-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/dagmawizerihun/Downloads/ECON307GPAProjectKhushiDagmawi.log
  log type:  text
 opened on:   4 May 2023, 21:42:23

. *I.Setting up and generating variables for our model estimation

. gen male = 1 if GENDER == "M"
(150 missing values generated)

. replace male = 0 if GENDER == "F"
(148 real changes made)

. drop AC

. drop AD

. drop AE AF AG AH AI AJ AK AL

. drop AM AN AO AP AQ AR AS AT AU AV AW AX AY AZ BA BB BC BD BE BF BG BH

. gen SAT_HSGPA = SAT*HSGPA
(12 missing values generated)

. gen HRSTD_SQ = HRSTD^2

. tabulate ETHNIC, generate(ethnic_dummy)

     ETHNIC |      Freq.     Percent        Cum.
------------+-----------------------------------
          I |        119       28.95       28.95
         NW |         55       13.38       42.34
          S |          1        0.24       42.58
         WH |        236       57.42      100.00
------------+-----------------------------------
      Total |        411      100.00

. 
. drop ethnic_dummy3

. drop if ETHNIC == "S"
(1 observation deleted)

. rename ethnic_dummy1 INTERNATIONAL

. rename ethnic_dummy2 NONWHITE

. rename ethnic_dummy4 WHITE

. gen GREEK_DRINK =  GREEK*DRINK

. gen DECISION_SCHOLAR = DECISION * SCHOLAR

. gen INTERNATIONAL_DOUBLE = INTERNATIONAL*DOUBLE
(4 missing values generated)

. drop male

. gen FEMALE = 1 if GENDER == F
type mismatch
r(109);

. gen FEMALE = 1 if GENDER == "F"
(263 missing values generated)

. replace FEMALE = 0 if GENDER == "M"
(261 real changes made)

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTER
> NATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DEC
> ISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

---------------------------------------------------------------------------------
        COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
            SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
          HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
      SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
          HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
       HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
        HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
         DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
         FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
          SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
  INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL~E |    .194713   .0756949     2.57   0.010     .0458682    .3435578
        SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
          GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
          DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
    GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
        ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
         FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
       DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
DECISION_SCHO~R |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
           HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
          _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
---------------------------------------------------------------------------------

. 
. 
. ssc install estout
checking estout consistency and verifying not already installed...
installing into /Users/dagmawizerihun/Library/Application Support/Stata/ado/plus/...
installation complete.

. . estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") sta
option sta not allowed
r(198);

. > ts(adjr2 N, labels("Adjusted R-squared" "Observations") fmt(3)) replace
> is not a valid command name
r(199);

. (output written to mytable.txt)
( is not a valid command name
r(199);

. 
. . estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted 
> R-squared" "Observations") fmt(3)) replace
estimation result Model1 not found
r(111);

. (output written to mytable.txt)
( is not a valid command name
r(199);

. 
. . estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted 
> R-squared" "Observations") fmt(3)) replace(output written to mytable.txt)
option replace() incorrectly specified
r(198);

. 
. estimates store Model1

. estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted 
unmatched quote
r(198);

. > R-squared" "Observations") fmt(3))
> is not a valid command name
r(199);

. 
. estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted R-
> squared" "Observations") fmt(3)) replace(output written to mytable.txt)
option replace() incorrectly specified
r(198);

. 
. estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted R-
> squared" "Observations") fmt(3))
(output written to mytable.txt)

. 
.  estout Model1 using mytable.txt, cells(b(star fmt(3)) se(fmt(3) par)) mlabels("Equation 1") stats(adjr2 N, labels("Adjusted R
> -squared" "Observations") fmt(3))
file mytable.txt already exists
r(602);

. 
. estout, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3))

----------------------------
                   Model1   
                     b/se   
----------------------------
SAT                 0.003***
                  (0.001)   
HSGPA               0.835***
                  (0.251)   
SAT_HSGPA          -0.000** 
                  (0.000)   
HRSTD               0.005   
                  (0.003)   
HRSTD_SQ           -0.000   
                  (0.000)   
HREXTRA            -0.000   
                  (0.002)   
DOUBLE             -0.010   
                  (0.046)   
FEMALE              0.102** 
                  (0.035)   
SLEEP              -0.003   
                  (0.002)   
INTERNATIO~L       -0.050   
                  (0.049)   
INTERNATIO~E        0.195*  
                  (0.076)   
SCHOLAR             0.136   
                  (0.078)   
GREEK               0.062   
                  (0.053)   
DRINK               0.005   
                  (0.003)   
GREEK_DRINK        -0.007   
                  (0.004)   
ATHLETE            -0.030   
                  (0.040)   
FRIEND              0.001*  
                  (0.001)   
DECISION           -0.029   
                  (0.104)   
DECISION_S~R       -0.037   
                  (0.109)   
HELP                0.003   
                  (0.006)   
_cons              -0.716   
                  (0.876)   
----------------------------
R-squared           0.358   
Adjusted R~d                
N                 392.000   
----------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTER
INTER ambiguous abbreviation
r(111);

. > NATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DEC
> is not a valid command name
r(199);

. > ISION DECISION_SCHOLAR HELP
> is not a valid command name
r(199);

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
> RINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. estadd scalar ar2 = e(r2_a)

added scalar:
                e(ar2) =  .3232982

. 
. estout, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3) scalar)
option scalar not allowed
r(198);

. 
. estout, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3))

----------------------------
                        .   
                     b/se   
----------------------------
SAT                 0.003***
                  (0.001)   
HSGPA               0.835***
                  (0.251)   
SAT_HSGPA          -0.000** 
                  (0.000)   
HRSTD               0.005   
                  (0.003)   
HRSTD_SQ           -0.000   
                  (0.000)   
HREXTRA            -0.000   
                  (0.002)   
DOUBLE             -0.010   
                  (0.046)   
FEMALE              0.102** 
                  (0.035)   
SLEEP              -0.003   
                  (0.002)   
INTERNATIO~L       -0.050   
                  (0.049)   
INTERNATIO~E        0.195*  
                  (0.076)   
SCHOLAR             0.136   
                  (0.078)   
GREEK               0.062   
                  (0.053)   
DRINK               0.005   
                  (0.003)   
GREEK_DRINK        -0.007   
                  (0.004)   
ATHLETE            -0.030   
                  (0.040)   
FRIEND              0.001*  
                  (0.001)   
DECISION           -0.029   
                  (0.104)   
DECISION_S~R       -0.037   
                  (0.109)   
HELP                0.003   
                  (0.006)   
_cons              -0.716   
                  (0.876)   
----------------------------
R-squared           0.358   
Adjusted R~d        0.323   
N                 392.000   
----------------------------

. 
. estimates store Model-1
- invalid name
1 invalid name
r(7);

. estimates store Model-1
- invalid name
1 invalid name
r(7);

. 
. estimates store Model_1

. 
. estout Model_1 using Modelstable.txt, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squa
> red" "N") fmt(3))
(output written to Modelstable.txt)

. estout Model_1 using Modelstable.txt, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3))
file Modelstable.txt already exists
r(602);

. 
. estout Model_1, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3))

----------------------------
                  Model_1   
                     b/se   
----------------------------
SAT                 0.003***
                  (0.001)   
HSGPA               0.835***
                  (0.251)   
SAT_HSGPA          -0.000** 
                  (0.000)   
HRSTD               0.005   
                  (0.003)   
HRSTD_SQ           -0.000   
                  (0.000)   
HREXTRA            -0.000   
                  (0.002)   
DOUBLE             -0.010   
                  (0.046)   
FEMALE              0.102** 
                  (0.035)   
SLEEP              -0.003   
                  (0.002)   
INTERNATIO~L       -0.050   
                  (0.049)   
INTERNATIO~E        0.195*  
                  (0.076)   
SCHOLAR             0.136   
                  (0.078)   
GREEK               0.062   
                  (0.053)   
DRINK               0.005   
                  (0.003)   
GREEK_DRINK        -0.007   
                  (0.004)   
ATHLETE            -0.030   
                  (0.040)   
FRIEND              0.001*  
                  (0.001)   
DECISION           -0.029   
                  (0.104)   
DECISION_S~R       -0.037   
                  (0.109)   
HELP                0.003   
                  (0.006)   
_cons              -0.716   
                  (0.876)   
----------------------------
R-squared           0.358   
Adjusted R~d        0.323   
N                 392.000   
----------------------------

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    147.48    0.006780
       HSGPA |     83.34    0.012000
         SAT |     37.08    0.026972
DECISION_S~R |     11.04    0.090606
    DECISION |     10.33    0.096791
       HRSTD |      7.88    0.126979
    HRSTD_SQ |      7.02    0.142366
 GREEK_DRINK |      4.01    0.249092
       DRINK |      2.68    0.373648
INTERNATIO~E |      2.58    0.387034
       GREEK |      2.44    0.409213
     SCHOLAR |      2.18    0.458747
INTERNATIO~L |      1.94    0.516086
      DOUBLE |      1.76    0.569380
     ATHLETE |      1.47    0.681543
     HREXTRA |      1.36    0.735983
        HELP |      1.27    0.787140
      FEMALE |      1.14    0.880205
      FRIEND |      1.09    0.914951
       SLEEP |      1.09    0.919875
-------------+----------------------
    Mean VIF |     16.46

.  reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
D ambiguous abbreviation
r(111);

. > RINK GREEK_DRINK ATHLETE FRIEND DECISION HELP
> is not a valid command name
r(199);

. 
. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRI
> END DECISION HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(19, 372)      =     10.90
       Model |  20.6722728        19  1.08801436   Prob > F        =    0.0000
    Residual |  37.1184436       372  .099780762   R-squared       =    0.3577
-------------+----------------------------------   Adj R-squared   =    0.3249
       Total |  57.7907164       391  .147802344   Root MSE        =    .31588

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025044   .0006305     3.97   0.000     .0012646    .0037443
               HSGPA |   .8244212   .2491111     3.31   0.001     .3345786    1.314264
           SAT_HSGPA |  -.0004893    .000178    -2.75   0.006    -.0008394   -.0001392
               HRSTD |   .0047346   .0027137     1.74   0.082    -.0006015    .0100707
            HRSTD_SQ |  -.0000466   .0000333    -1.40   0.162     -.000112    .0000188
             HREXTRA |  -.0003295   .0020519    -0.16   0.873    -.0043642    .0037052
              DOUBLE |  -.0101172   .0454393    -0.22   0.824    -.0994674    .0792329
              FEMALE |   .1020871    .035224     2.90   0.004     .0328241    .1713502
               SLEEP |  -.0027951   .0015249    -1.83   0.068    -.0057937    .0002034
       INTERNATIONAL |    -.05042   .0489895    -1.03   0.304    -.1467511    .0459111
INTERNATIONAL_DOUBLE |   .1960892   .0754983     2.60   0.010     .0476321    .3445462
             SCHOLAR |   .1177197   .0558042     2.11   0.036     .0079884    .2274511
               GREEK |    .064023    .052473     1.22   0.223    -.0391579     .167204
               DRINK |   .0049809   .0030378     1.64   0.102    -.0009925    .0109543
         GREEK_DRINK |  -.0071163   .0041467    -1.72   0.087    -.0152702    .0010376
             ATHLETE |  -.0309503   .0395786    -0.78   0.435    -.1087762    .0468755
              FRIEND |   .0013741   .0005581     2.46   0.014     .0002768    .0024714
            DECISION |  -.0630048   .0339096    -1.86   0.064    -.1296833    .0036738
                HELP |   .0026882   .0055952     0.48   0.631    -.0083141    .0136904
               _cons |  -.6620974   .8610037    -0.77   0.442    -2.355142    1.030947
--------------------------------------------------------------------------------------

. 
. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    145.30    0.006882
       HSGPA |     82.07    0.012184
         SAT |     36.47    0.027419
       HRSTD |      7.86    0.127164
    HRSTD_SQ |      7.02    0.142397
 GREEK_DRINK |      3.97    0.252081
       DRINK |      2.61    0.383705
INTERNATIO~E |      2.58    0.388129
       GREEK |      2.42    0.412391
INTERNATIO~L |      1.93    0.516945
      DOUBLE |      1.75    0.570050
     ATHLETE |      1.46    0.684474
     HREXTRA |      1.36    0.736222
        HELP |      1.27    0.787274
      FEMALE |      1.14    0.880221
     SCHOLAR |      1.12    0.892063
    DECISION |      1.11    0.901333
      FRIEND |      1.09    0.914958
       SLEEP |      1.09    0.921120
-------------+----------------------
    Mean VIF |     15.98

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   1.97
Prob > chi2 = 0.1605

.  reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRI
> END DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. 
. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   2.11
Prob > chi2 = 0.1462

. predict resids, residuals
(18 missing values generated)

. predict fitted, xb
(18 missing values generated)

. 
. scatter resids fitted, yline(0)

. 
. rvfplot, yline(0)

. ovtest

Ramsey RESET test for omitted variables
Omitted: Powers of fitted values of COLLGPA

H0: Model has no omitted variables

F(3, 368) =   7.59
 Prob > F = 0.0001

. log close
      name:  <unnamed>
       log:  /Users/dagmawizerihun/Downloads/ECON307GPAProjectKhushiDagmawi.log
  log type:  text
 closed on:   5 May 2023, 14:04:03
----------------------------------------------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/dagmawizerihun/Downloads/ECON307GPAProjectKhushiDagmawi.log
  log type:  text
 opened on:   5 May 2023, 14:13:10

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK 
> GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    147.48    0.006780
       HSGPA |     83.34    0.012000
         SAT |     37.08    0.026972
DECISION_S~R |     11.04    0.090606
    DECISION |     10.33    0.096791
       HRSTD |      7.88    0.126979
    HRSTD_SQ |      7.02    0.142366
 GREEK_DRINK |      4.01    0.249092
       DRINK |      2.68    0.373648
INTERNATIO~E |      2.58    0.387034
       GREEK |      2.44    0.409213
     SCHOLAR |      2.18    0.458747
INTERNATIO~L |      1.94    0.516086
      DOUBLE |      1.76    0.569380
     ATHLETE |      1.47    0.681543
     HREXTRA |      1.36    0.735983
        HELP |      1.27    0.787140
      FEMALE |      1.14    0.880205
      FRIEND |      1.09    0.914951
       SLEEP |      1.09    0.919875
-------------+----------------------
    Mean VIF |     16.46

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(19, 372)      =     10.75
       Model |  20.4893016        19   1.0783843   Prob > F        =    0.0000
    Residual |  37.3014148       372   .10027262   R-squared       =    0.3545
-------------+----------------------------------   Adj R-squared   =    0.3216
       Total |  57.7907164       391  .147802344   Root MSE        =    .31666

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0026124   .0006347     4.12   0.000     .0013644    .0038605
               HSGPA |   .8658187   .2506654     3.45   0.001     .3729199    1.358717
           SAT_HSGPA |  -.0005155   .0001793    -2.87   0.004    -.0008681   -.0001629
               HRSTD |   .0012499   .0011333     1.10   0.271    -.0009785    .0034783
             HREXTRA |  -.0003922   .0020569    -0.19   0.849    -.0044368    .0036525
              DOUBLE |  -.0086099   .0455726    -0.19   0.850    -.0982222    .0810023
              FEMALE |   .1004288   .0352897     2.85   0.005     .0310365     .169821
               SLEEP |  -.0028348   .0015296    -1.85   0.065    -.0058426     .000173
       INTERNATIONAL |  -.0485931   .0491441    -0.99   0.323    -.1452282     .048042
INTERNATIONAL_DOUBLE |   .1960896   .0757847     2.59   0.010     .0470696    .3451097
             SCHOLAR |   .1344173   .0779975     1.72   0.086    -.0189539    .2877885
               GREEK |   .0627772   .0528055     1.19   0.235    -.0410575     .166612
               DRINK |    .004645   .0030837     1.51   0.133    -.0014187    .0107087
         GREEK_DRINK |  -.0069608   .0041818    -1.66   0.097    -.0151837     .001262
             ATHLETE |  -.0298108   .0397608    -0.75   0.454     -.107995    .0483734
              FRIEND |   .0013729   .0005594     2.45   0.015     .0002729    .0024729
            DECISION |  -.0294184   .1037329    -0.28   0.777    -.2333948     .174558
    DECISION_SCHOLAR |  -.0397034   .1094488    -0.36   0.717    -.2549193    .1755126
                HELP |   .0038462   .0055502     0.69   0.489    -.0070676      .01476
               _cons |  -.8018262    .875167    -0.92   0.360    -2.522721    .9190685
--------------------------------------------------------------------------------------

. gen LN_HRSTD = ln(HRSTD)
(2 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_
> DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     10.98
       Model |  20.7221243        19  1.09063812   Prob > F        =    0.0000
    Residual |  36.7480402       370  .099319028   R-squared       =    0.3606
-------------+----------------------------------   Adj R-squared   =    0.3277
       Total |  57.4701645       389  .147738212   Root MSE        =    .31515

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024846   .0006341     3.92   0.000     .0012377    .0037315
               HSGPA |   .8195456   .2505466     3.27   0.001     .3268717    1.312219
           SAT_HSGPA |  -.0004867   .0001791    -2.72   0.007    -.0008388   -.0001346
            LN_HRSTD |   .0565297   .0236201     2.39   0.017     .0100832    .1029763
             HREXTRA |   -.000772   .0020467    -0.38   0.706    -.0047967    .0032527
              DOUBLE |  -.0073324   .0454043    -0.16   0.872    -.0966152    .0819505
              FEMALE |   .0985667   .0350093     2.82   0.005     .0297246    .1674088
               SLEEP |  -.0027297   .0015253    -1.79   0.074    -.0057292    .0002697
       INTERNATIONAL |  -.0534169   .0490303    -1.09   0.277    -.1498298    .0429961
INTERNATIONAL_DOUBLE |    .196749   .0754158     2.61   0.009     .0484515    .3450464
             SCHOLAR |   .1320245   .0776244     1.70   0.090    -.0206158    .2846648
               GREEK |   .0638051   .0526247     1.21   0.226    -.0396759    .1672861
               DRINK |   .0054269   .0030806     1.76   0.079    -.0006307    .0114845
         GREEK_DRINK |  -.0071974   .0041615    -1.73   0.085    -.0153806    .0009859
             ATHLETE |  -.0270897   .0395236    -0.69   0.494    -.1048088    .0506295
              FRIEND |   .0012707   .0005559     2.29   0.023     .0001776    .0023637
            DECISION |  -.0327203   .1031846    -0.32   0.751    -.2356221    .1701815
    DECISION_SCHOLAR |  -.0312304   .1089692    -0.29   0.775     -.245507    .1830461
                HELP |   .0018303   .0055642     0.33   0.742    -.0091112    .0127717
               _cons |  -.7301399   .8705726    -0.84   0.402    -2.442031    .9817508
--------------------------------------------------------------------------------------

. 
. gen LNHRSTD_SQ = LN_HRSTD^2
(2 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
> RINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(20, 369)      =     10.59
       Model |   20.954001        20  1.04770005   Prob > F        =    0.0000
    Residual |  36.5161635       369  .098959793   R-squared       =    0.3646
-------------+----------------------------------   Adj R-squared   =    0.3302
       Total |  57.4701645       389  .147738212   Root MSE        =    .31458

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024869    .000633     3.93   0.000     .0012423    .0037316
               HSGPA |    .807221   .2502226     3.23   0.001     .3151798    1.299262
           SAT_HSGPA |  -.0004821   .0001788    -2.70   0.007    -.0008336   -.0001306
            LN_HRSTD |    .197886   .0953078     2.08   0.039     .0104713    .3853006
          LNHRSTD_SQ |  -.0275998   .0180304    -1.53   0.127     -.063055    .0078555
             HREXTRA |  -.0007171   .0020434    -0.35   0.726    -.0047351     .003301
              DOUBLE |  -.0077982   .0453231    -0.17   0.863    -.0969222    .0813258
              FEMALE |   .1023872   .0350349     2.92   0.004     .0334941    .1712804
               SLEEP |  -.0025875   .0015254    -1.70   0.091    -.0055871    .0004121
       INTERNATIONAL |  -.0547897   .0489497    -1.12   0.264    -.1510451    .0414657
INTERNATIONAL_DOUBLE |   .2030607   .0753922     2.69   0.007     .0548085    .3513129
             SCHOLAR |   .1338206   .0774928     1.73   0.085    -.0185623    .2862034
               GREEK |   .0571613   .0527084     1.08   0.279    -.0464853    .1608079
               DRINK |   .0053619   .0030753     1.74   0.082    -.0006853    .0114092
         GREEK_DRINK |  -.0068222   .0041612    -1.64   0.102    -.0150049    .0013605
             ATHLETE |  -.0314469   .0395546    -0.80   0.427    -.1092277    .0463339
              FRIEND |   .0014109   .0005624     2.51   0.013     .0003051    .0025168
            DECISION |  -.0252131   .1031145    -0.24   0.807    -.2279789    .1775527
    DECISION_SCHOLAR |  -.0358957   .1088146    -0.33   0.742    -.2498702    .1780788
                HELP |   .0021725   .0055587     0.39   0.696    -.0087581    .0131031
               _cons |  -.8875767   .8750621    -1.01   0.311    -2.608311    .8331574
--------------------------------------------------------------------------------------

. 
. gen LN_SLEEP = ln(SLEEP)
(4 missing values generated)

. gen (LN_HELP) = ln(HELP)
( invalid name
r(198);

.  gen LN_HELP = ln(HELP)
(123 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE LN_SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GRE
> EK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     10.98
       Model |  20.7202229        19  1.09053805   Prob > F        =    0.0000
    Residual |  36.7499416       370  .099324166   R-squared       =    0.3605
-------------+----------------------------------   Adj R-squared   =    0.3277
       Total |  57.4701645       389  .147738212   Root MSE        =    .31516

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024688   .0006329     3.90   0.000     .0012243    .0037133
               HSGPA |   .8105141   .2499307     3.24   0.001     .3190512    1.301977
           SAT_HSGPA |  -.0004805   .0001786    -2.69   0.007    -.0008317   -.0001292
            LN_HRSTD |   .0558875   .0236163     2.37   0.018     .0094484    .1023265
             HREXTRA |  -.0005833   .0020472    -0.28   0.776    -.0046088    .0034423
              DOUBLE |  -.0054315   .0453864    -0.12   0.905    -.0946791     .083816
              FEMALE |   .0971971   .0350386     2.77   0.006     .0282972    .1660969
            LN_SLEEP |  -.0795266   .0445732    -1.78   0.075    -.1671752     .008122
       INTERNATIONAL |  -.0512761    .049111    -1.04   0.297    -.1478479    .0452956
INTERNATIONAL_DOUBLE |   .1911225   .0754654     2.53   0.012     .0427276    .3395174
             SCHOLAR |   .1361247   .0777432     1.75   0.081    -.0167492    .2889987
               GREEK |    .061491   .0525251     1.17   0.242    -.0417941    .1647761
               DRINK |   .0052548   .0030706     1.71   0.088    -.0007832    .0112927
         GREEK_DRINK |   -.007128   .0041602    -1.71   0.087    -.0153087    .0010527
             ATHLETE |  -.0302574   .0395327    -0.77   0.445    -.1079944    .0474796
              FRIEND |   .0012327    .000555     2.22   0.027     .0001414    .0023241
            DECISION |  -.0305049   .1032403    -0.30   0.768    -.2335162    .1725064
    DECISION_SCHOLAR |   -.032039   .1089922    -0.29   0.769    -.2463608    .1822829
                HELP |   .0013696   .0055957     0.24   0.807    -.0096337    .0123729
               _cons |   -.536084   .8704019    -0.62   0.538    -2.247639    1.175471
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE LN_SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GRE
> EK D
D ambiguous abbreviation
r(111);

. > RINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP
> is not a valid command name
r(199);

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE LN_SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GRE
> EK DRINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(20, 369)      =     10.58
       Model |  20.9451886        20  1.04725943   Prob > F        =    0.0000
    Residual |  36.5249759       369  .098983675   R-squared       =    0.3645
-------------+----------------------------------   Adj R-squared   =    0.3300
       Total |  57.4701645       389  .147738212   Root MSE        =    .31462

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024701   .0006318     3.91   0.000     .0012277    .0037125
               HSGPA |   .7982165   .2496353     3.20   0.002     .3073303    1.289103
           SAT_HSGPA |  -.0004758   .0001783    -2.67   0.008    -.0008264   -.0001251
            LN_HRSTD |   .1952829   .0954222     2.05   0.041     .0076434    .3829224
          LNHRSTD_SQ |  -.0272109   .0180496    -1.51   0.133    -.0627039     .008282
             HREXTRA |  -.0005401   .0020438    -0.26   0.792    -.0045591     .003479
              DOUBLE |  -.0059825     .04531    -0.13   0.895    -.0950806    .0831157
              FEMALE |   .1010697   .0350727     2.88   0.004     .0321022    .1700372
            LN_SLEEP |  -.0744997   .0446215    -1.67   0.096     -.162244    .0132447
       INTERNATIONAL |  -.0528205   .0490375    -1.08   0.282    -.1492485    .0436075
INTERNATIONAL_DOUBLE |   .1976917   .0754618     2.62   0.009     .0493025    .3460809
             SCHOLAR |   .1375774   .0776158     1.77   0.077    -.0150474    .2902022
               GREEK |   .0549858   .0526122     1.05   0.297    -.0484716    .1584432
               DRINK |   .0051937   .0030656     1.69   0.091    -.0008345    .0112218
         GREEK_DRINK |  -.0067589   .0041603    -1.62   0.105    -.0149398     .001422
             ATHLETE |   -.034368    .039559    -0.87   0.386    -.1121573    .0434214
              FRIEND |   .0013727   .0005618     2.44   0.015      .000268    .0024774
            DECISION |  -.0233228   .1031732    -0.23   0.821     -.226204    .1795585
    DECISION_SCHOLAR |  -.0364924   .1088453    -0.34   0.738    -.2505273    .1775425
                HELP |   .0017476   .0055917     0.31   0.755     -.009248    .0127431
               _cons |  -.7023865    .875883    -0.80   0.423    -2.424735    1.019962
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 
> DRINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR LN_HELP 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(20, 252)      =      8.83
       Model |  14.7290294        20  .736451472   Prob > F        =    0.0000
    Residual |   21.024535       252  .083430694   R-squared       =    0.4120
-------------+----------------------------------   Adj R-squared   =    0.3653
       Total |  35.7535644       272  .131446928   Root MSE        =    .28884

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028563   .0006598     4.33   0.000     .0015568    .0041558
               HSGPA |   1.068758   .2630224     4.06   0.000     .5507557     1.58676
           SAT_HSGPA |  -.0006329   .0001845    -3.43   0.001    -.0009964   -.0002695
            LN_HRSTD |   .3914932    .125569     3.12   0.002     .1441948    .6387916
          LNHRSTD_SQ |  -.0599906    .022611    -2.65   0.008    -.1045213   -.0154599
             HREXTRA |   .0001513   .0022398     0.07   0.946    -.0042598    .0045625
              DOUBLE |  -.0427615   .0482495    -0.89   0.376    -.1377852    .0522621
              FEMALE |   .0499579   .0393482     1.27   0.205    -.0275354    .1274512
               SLEEP |  -.0028096   .0015779    -1.78   0.076    -.0059172    .0002981
       INTERNATIONAL |   .0081441   .0568644     0.14   0.886    -.1038459    .1201342
INTERNATIONAL_DOUBLE |   .1551978   .0800889     1.94   0.054    -.0025311    .3129268
             SCHOLAR |   .1663825   .0787589     2.11   0.036      .011273     .321492
               GREEK |   .0779149   .0616394     1.26   0.207     -.043479    .1993088
               DRINK |   .0026289   .0035593     0.74   0.461    -.0043809    .0096387
         GREEK_DRINK |  -.0115127   .0054798    -2.10   0.037    -.0223047   -.0007206
             ATHLETE |   .0052104   .0437506     0.12   0.905    -.0809531    .0913738
              FRIEND |   .0017699   .0006282     2.82   0.005     .0005328     .003007
            DECISION |   .0723325   .1026483     0.70   0.482    -.1298253    .2744903
    DECISION_SCHOLAR |  -.1216305   .1100639    -1.11   0.270    -.3383929    .0951319
             LN_HELP |   .0271702   .0258031     1.05   0.293    -.0236471    .0779874
               _cons |  -1.911335   .9280643    -2.06   0.040    -3.739085   -.0835842
--------------------------------------------------------------------------------------

. 
. gen LN_SAT = ln(SAT)
(11 missing values generated)

. 
.  reg COLLGPA LN_SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GRE
> EK DRINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR LN_HELP 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(20, 252)      =      7.36
       Model |  13.1781529        20  .658907647   Prob > F        =    0.0000
    Residual |  22.5754115       252  .089584966   R-squared       =    0.3686
-------------+----------------------------------   Adj R-squared   =    0.3185
       Total |  35.7535644       272  .131446928   Root MSE        =    .29931

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
              LN_SAT |   .0793591   .2124155     0.37   0.709    -.3389768     .497695
               HSGPA |   .0028036   .1156669     0.02   0.981    -.2249933    .2306006
           SAT_HSGPA |   .0001281    .000073     1.76   0.080    -.0000156    .0002718
            LN_HRSTD |   .4195683   .1299464     3.23   0.001      .163649    .6754876
          LNHRSTD_SQ |  -.0616452    .023427    -2.63   0.009    -.1077828   -.0155075
             HREXTRA |  -.0000712   .0023204    -0.03   0.976    -.0046409    .0044986
              DOUBLE |  -.0523285   .0499735    -1.05   0.296    -.1507474    .0460904
              FEMALE |   .0583004   .0407252     1.43   0.154    -.0219047    .1385055
               SLEEP |  -.0019813   .0016812    -1.18   0.240    -.0052923    .0013297
       INTERNATIONAL |  -.0268862   .0583486    -0.46   0.645    -.1417992    .0880268
INTERNATIONAL_DOUBLE |   .1575514    .082989     1.90   0.059     -.005889    .3209918
             SCHOLAR |   .1796947   .0816148     2.20   0.029     .0189608    .3404286
               GREEK |   .0796163   .0638965     1.25   0.214    -.0462229    .2054554
               DRINK |   .0006572   .0036595     0.18   0.858    -.0065499    .0078644
         GREEK_DRINK |  -.0107496   .0056757    -1.89   0.059    -.0219274    .0004282
             ATHLETE |    .009068   .0454304     0.20   0.842    -.0804035    .0985396
              FRIEND |   .0016781   .0006532     2.57   0.011     .0003917    .0029644
            DECISION |   .0376727   .1060606     0.36   0.723    -.1712055    .2465508
    DECISION_SCHOLAR |  -.0976268   .1140363    -0.86   0.393    -.3222125    .1269589
             LN_HELP |   .0324804   .0267474     1.21   0.226    -.0201965    .0851573
               _cons |     1.4031   1.554208     0.90   0.368    -1.657793    4.463993
--------------------------------------------------------------------------------------

. 
. 
. gen HSGPA_SCHOLAR = HSGPA*SCHOLAR
(1 missing value generated)

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 
> DRINK GREEK_DRINK ATHLETE FRIEND DECISION LN_HELP HSGPA_SCHOLAR 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(20, 252)      =      8.82
       Model |  14.7245881        20  .736229404   Prob > F        =    0.0000
    Residual |  21.0289763       252  .083448319   R-squared       =    0.4118
-------------+----------------------------------   Adj R-squared   =    0.3652
       Total |  35.7535644       272  .131446928   Root MSE        =    .28887

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025362    .000708     3.58   0.000     .0011418    .0039305
               HSGPA |   1.109189   .2679806     4.14   0.000     .5814216    1.636956
           SAT_HSGPA |  -.0005469   .0001965    -2.78   0.006     -.000934   -.0001599
            LN_HRSTD |   .3747854   .1259554     2.98   0.003     .1267259    .6228448
          LNHRSTD_SQ |  -.0565615   .0226484    -2.50   0.013    -.1011658   -.0119573
             HREXTRA |  -1.80e-06   .0022441    -0.00   0.999    -.0044213    .0044177
              DOUBLE |  -.0421016    .048287    -0.87   0.384    -.1371992     .052996
              FEMALE |   .0487718   .0393086     1.24   0.216    -.0286434     .126187
               SLEEP |  -.0028205   .0015783    -1.79   0.075    -.0059288    .0002878
       INTERNATIONAL |   .0124751   .0570472     0.22   0.827     -.099875    .1248252
INTERNATIONAL_DOUBLE |   .1451285   .0809745     1.79   0.074    -.0143444    .3046015
             SCHOLAR |   .7002588   .5535746     1.26   0.207    -.3899634    1.790481
               GREEK |   .0838361   .0614293     1.36   0.174    -.0371441    .2048163
               DRINK |   .0035024   .0034979     1.00   0.318    -.0033863    .0103912
         GREEK_DRINK |  -.0125488   .0054683    -2.29   0.023    -.0233182   -.0017794
             ATHLETE |   .0022314   .0436051     0.05   0.959    -.0836454    .0881082
              FRIEND |   .0016902   .0006292     2.69   0.008      .000451    .0029294
            DECISION |  -.0322571    .037451    -0.86   0.390    -.1060139    .0414997
             LN_HELP |   .0244541   .0257055     0.95   0.342    -.0261708    .0750791
       HSGPA_SCHOLAR |  -.1691211   .1565036    -1.08   0.281    -.4773428    .1391006
               _cons |  -1.952891   .9336384    -2.09   0.037     -3.79162   -.1141631
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 
> DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(18, 254)      =      9.70
       Model |   14.561161        18  .808953391   Prob > F        =    0.0000
    Residual |  21.1924034       254  .083434659   R-squared       =    0.4073
-------------+----------------------------------   Adj R-squared   =    0.3653
       Total |  35.7535644       272  .131446928   Root MSE        =    .28885

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028629   .0006567     4.36   0.000     .0015696    .0041563
               HSGPA |   1.062925    .262231     4.05   0.000     .5465007    1.579349
           SAT_HSGPA |  -.0006295    .000184    -3.42   0.001    -.0009918   -.0002672
            LN_HRSTD |   .3899159   .1254241     3.11   0.002     .1429123    .6369196
          LNHRSTD_SQ |  -.0591235   .0225632    -2.62   0.009    -.1035583   -.0146886
             HREXTRA |  -.0001155   .0022209    -0.05   0.959    -.0044893    .0042582
              DOUBLE |  -.0469942   .0481564    -0.98   0.330    -.1418308    .0478425
              FEMALE |   .0496324   .0392204     1.27   0.207    -.0276062    .1268711
               SLEEP |  -.0028674   .0015753    -1.82   0.070    -.0059697    .0002349
       INTERNATIONAL |   .0069707   .0568593     0.12   0.903    -.1050049    .1189464
INTERNATIONAL_DOUBLE |   .1596901    .080026     2.00   0.047     .0020911    .3172892
             SCHOLAR |   .1081419   .0558396     1.94   0.054    -.0018257    .2181094
               GREEK |   .0824486   .0614097     1.34   0.181    -.0384884    .2033857
               DRINK |   .0037386   .0034709     1.08   0.282    -.0030969    .0105741
         GREEK_DRINK |  -.0126162   .0054235    -2.33   0.021     -.023297   -.0019355
             ATHLETE |  -.0013099   .0435082    -0.03   0.976    -.0869928    .0843729
              FRIEND |   .0017039   .0006263     2.72   0.007     .0004705    .0029373
             LN_HELP |   .0257217   .0256745     1.00   0.317    -.0248403    .0762837
               _cons |  -1.871584   .9182452    -2.04   0.043    -3.679928   -.0632398
--------------------------------------------------------------------------------------

. 
. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(13, 376)      =     14.95
       Model |  19.5792043        13  1.50609264   Prob > F        =    0.0000
    Residual |  37.8909602       376   .10077383   R-squared       =    0.3407
-------------+----------------------------------   Adj R-squared   =    0.3179
       Total |  57.4701645       389  .147738212   Root MSE        =    .31745

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0023436   .0006224     3.77   0.000     .0011197    .0035675
               HSGPA |   .7259889    .246469     2.95   0.003     .2413587    1.210619
           SAT_HSGPA |  -.0004302   .0001763    -2.44   0.015    -.0007769   -.0000834
            LN_HRSTD |   .1810299   .0945565     1.91   0.056    -.0048959    .3669558
          LNHRSTD_SQ |   -.022393    .017808    -1.26   0.209    -.0574087    .0126228
             HREXTRA |   -.001745   .0018222    -0.96   0.339     -.005328    .0018381
              DOUBLE |  -.0184428   .0448367    -0.41   0.681    -.1066049    .0697194
              FEMALE |   .1032496   .0348525     2.96   0.003     .0347194    .1717799
               SLEEP |  -.0021272   .0015137    -1.41   0.161    -.0051037    .0008492
       INTERNATIONAL |  -.0608049   .0488791    -1.24   0.214    -.1569156    .0353058
INTERNATIONAL_DOUBLE |   .2127833   .0748698     2.84   0.005     .0655673    .3599993
             SCHOLAR |    .102635   .0546516     1.88   0.061    -.0048261    .2100961
               GREEK |   .0072223   .0364143     0.20   0.843    -.0643789    .0788235
               _cons |  -.5851741   .8462963    -0.69   0.490    -2.249241    1.078893
--------------------------------------------------------------------------------------

. DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION 
command DRINK is unrecognized
r(199);

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
> RINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(19, 253)      =      9.22
       Model |   14.627142        19  .769849577   Prob > F        =    0.0000
    Residual |  21.1264224       253  .083503646   R-squared       =    0.4091
-------------+----------------------------------   Adj R-squared   =    0.3647
       Total |  35.7535644       272  .131446928   Root MSE        =    .28897

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028161   .0006591     4.27   0.000     .0015181    .0041142
               HSGPA |   1.051326   .2626637     4.00   0.000     .5340405    1.568612
           SAT_HSGPA |  -.0006209   .0001843    -3.37   0.001    -.0009838   -.0002579
            LN_HRSTD |   .3863855   .1255388     3.08   0.002     .1391514    .6336197
          LNHRSTD_SQ |  -.0585321   .0225824    -2.59   0.010    -.1030054   -.0140587
             HREXTRA |    .000143   .0022408     0.06   0.949      -.00427     .004556
              DOUBLE |  -.0450326   .0482268    -0.93   0.351    -.1400097    .0499445
              FEMALE |   .0475625   .0393057     1.21   0.227    -.0298455    .1249705
               SLEEP |  -.0027876   .0015785    -1.77   0.079    -.0058963    .0003211
       INTERNATIONAL |   .0075958   .0568871     0.13   0.894    -.1044367    .1196284
INTERNATIONAL_DOUBLE |   .1583338   .0800736     1.98   0.049      .000638    .3160296
             SCHOLAR |   .1051174   .0559662     1.88   0.061    -.0051016    .2153363
               GREEK |   .0836241   .0614493     1.36   0.175    -.0373932    .2046415
               DRINK |   .0033711   .0034969     0.96   0.336    -.0035156    .0102579
         GREEK_DRINK |  -.0121128   .0054552    -2.22   0.027    -.0228562   -.0013694
             ATHLETE |   .0010211   .0436051     0.02   0.981    -.0848542    .0868964
              FRIEND |   .0017392   .0006278     2.77   0.006     .0005028    .0029756
             LN_HELP |   .0246501   .0257134     0.96   0.339    -.0259895    .0752896
            DECISION |  -.0332906   .0374512    -0.89   0.375    -.1070464    .0404652
               _cons |  -1.795861   .9225661    -1.95   0.053    -3.612749    .0210267
--------------------------------------------------------------------------------------

. 
. gen SAT_GREEK = SAT*GREEK
(11 missing values generated)

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 
> SAT_GREEK DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(20, 252)      =      8.75
       Model |   14.651834        20  .732591698   Prob > F        =    0.0000
    Residual |  21.1017305       252  .083737026   R-squared       =    0.4098
-------------+----------------------------------   Adj R-squared   =    0.3630
       Total |  35.7535644       272  .131446928   Root MSE        =    .28937

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0027892   .0006619     4.21   0.000     .0014857    .0040928
               HSGPA |   1.056014   .2631721     4.01   0.000     .5377171    1.574311
           SAT_HSGPA |   -.000624   .0001847    -3.38   0.001    -.0009877   -.0002603
            LN_HRSTD |   .3840584   .1257871     3.05   0.003     .1363305    .6317864
          LNHRSTD_SQ |  -.0582039    .022622    -2.57   0.011    -.1027561   -.0136517
             HREXTRA |   .0001492    .002244     0.07   0.947    -.0042701    .0045685
              DOUBLE |  -.0487661   .0487811    -1.00   0.318    -.1448366    .0473045
              FEMALE |   .0469293   .0393778     1.19   0.234    -.0306223    .1244809
               SLEEP |  -.0026612   .0015978    -1.67   0.097    -.0058079    .0004855
       INTERNATIONAL |   .0068753    .056982     0.12   0.904    -.1053463    .1190969
INTERNATIONAL_DOUBLE |    .162056   .0804779     2.01   0.045      .003561     .320551
             SCHOLAR |   .1095133    .056626     1.93   0.054    -.0020072    .2210337
               GREEK |  -.1044412   .3517536    -0.30   0.767    -.7971926    .5883103
           SAT_GREEK |   .0001425   .0002624     0.54   0.588    -.0003743    .0006593
               DRINK |   .0031698   .0035214     0.90   0.369    -.0037653    .0101048
         GREEK_DRINK |  -.0117533   .0055028    -2.14   0.034    -.0225907   -.0009159
             ATHLETE |   .0016095   .0436795     0.04   0.971    -.0844139    .0876328
              FRIEND |   .0016921   .0006346     2.67   0.008     .0004423     .002942
             LN_HELP |   .0249588   .0257556     0.97   0.333    -.0257648    .0756824
            DECISION |  -.0328002   .0375143    -0.87   0.383    -.1066818    .0410813
               _cons |   -1.76631   .9254558    -1.91   0.057    -3.588923    .0563033
--------------------------------------------------------------------------------------

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(13, 376)      =     14.95
       Model |  19.5792043        13  1.50609264   Prob > F        =    0.0000
    Residual |  37.8909602       376   .10077383   R-squared       =    0.3407
-------------+----------------------------------   Adj R-squared   =    0.3179
       Total |  57.4701645       389  .147738212   Root MSE        =    .31745

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0023436   .0006224     3.77   0.000     .0011197    .0035675
               HSGPA |   .7259889    .246469     2.95   0.003     .2413587    1.210619
           SAT_HSGPA |  -.0004302   .0001763    -2.44   0.015    -.0007769   -.0000834
            LN_HRSTD |   .1810299   .0945565     1.91   0.056    -.0048959    .3669558
          LNHRSTD_SQ |   -.022393    .017808    -1.26   0.209    -.0574087    .0126228
             HREXTRA |   -.001745   .0018222    -0.96   0.339     -.005328    .0018381
              DOUBLE |  -.0184428   .0448367    -0.41   0.681    -.1066049    .0697194
              FEMALE |   .1032496   .0348525     2.96   0.003     .0347194    .1717799
               SLEEP |  -.0021272   .0015137    -1.41   0.161    -.0051037    .0008492
       INTERNATIONAL |  -.0608049   .0488791    -1.24   0.214    -.1569156    .0353058
INTERNATIONAL_DOUBLE |   .2127833   .0748698     2.84   0.005     .0655673    .3599993
             SCHOLAR |    .102635   .0546516     1.88   0.061    -.0048261    .2100961
               GREEK |   .0072223   .0364143     0.20   0.843    -.0643789    .0788235
               _cons |  -.5851741   .8462963    -0.69   0.490    -2.249241    1.078893
--------------------------------------------------------------------------------------

. SAT_GREEK DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION HSGPA_SCHOLAR 
command SAT_GREEK is unrecognized
r(199);

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK S
> AT_GREEK DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION HSGPA_SCHOLAR 

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(21, 251)      =      8.40
       Model |  14.7541593        21  .702579016   Prob > F        =    0.0000
    Residual |  20.9994051       251  .083662968   R-squared       =    0.4127
-------------+----------------------------------   Adj R-squared   =    0.3635
       Total |  35.7535644       272  .131446928   Root MSE        =    .28925

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024994   .0007116     3.51   0.001      .001098    .0039009
               HSGPA |   1.115821   .2685568     4.15   0.000     .5869086    1.644733
           SAT_HSGPA |  -.0005484   .0001968    -2.79   0.006     -.000936   -.0001608
            LN_HRSTD |   .3719359   .1262084     2.95   0.004     .1233736    .6204983
          LNHRSTD_SQ |  -.0561511    .022688    -2.47   0.014    -.1008342   -.0114679
             HREXTRA |   1.22e-06   .0022469     0.00   1.000    -.0044241    .0044265
              DOUBLE |   -.046116   .0488183    -0.94   0.346    -.1422618    .0500298
              FEMALE |   .0481093   .0393749     1.22   0.223    -.0294379    .1256566
               SLEEP |  -.0026829   .0015972    -1.68   0.094    -.0058284    .0004627
       INTERNATIONAL |   .0118119   .0571314     0.21   0.836    -.1007062      .12433
INTERNATIONAL_DOUBLE |    .148865   .0813218     1.83   0.068     -.011295     .309025
             SCHOLAR |   .7204641    .555327     1.30   0.196    -.3732304    1.814159
               GREEK |  -.1221946   .3519643    -0.35   0.729    -.8153743    .5709852
           SAT_GREEK |   .0001561   .0002626     0.59   0.553    -.0003611    .0006733
               DRINK |   .0032852   .0035214     0.93   0.352      -.00365    .0102204
         GREEK_DRINK |  -.0121662    .005513    -2.21   0.028    -.0230239   -.0013085
             ATHLETE |   .0029073   .0436759     0.07   0.947    -.0831107    .0889253
              FRIEND |   .0016374   .0006363     2.57   0.011     .0003843    .0028905
             LN_HELP |   .0247873   .0257446     0.96   0.337    -.0259158    .0754903
            DECISION |  -.0316931   .0375111    -0.84   0.399    -.1055698    .0421835
       HSGPA_SCHOLAR |  -.1734943   .1568773    -1.11   0.270    -.4824579    .1354693
               _cons |  -1.924577   .9360508    -2.06   0.041    -3.768092   -.0810625
--------------------------------------------------------------------------------------

. 
. gen LN_HREXTRA = ln(HREXTRA + 1)

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GRE
> EK DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(19, 253)      =      9.31
       Model |  14.7074696        19  .774077346   Prob > F        =    0.0000
    Residual |  21.0460948       253  .083186146   R-squared       =    0.4114
-------------+----------------------------------   Adj R-squared   =    0.3672
       Total |  35.7535644       272  .131446928   Root MSE        =    .28842

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028009   .0006579     4.26   0.000     .0015053    .0040965
               HSGPA |    1.04087   .2623745     3.97   0.000     .5241538    1.557587
           SAT_HSGPA |   -.000617   .0001839    -3.35   0.001    -.0009792   -.0002548
            LN_HRSTD |   .3986113   .1253568     3.18   0.002     .1517355    .6454871
          LNHRSTD_SQ |  -.0611627   .0225158    -2.72   0.007     -.105505   -.0168204
          LN_HREXTRA |    .024198   .0245728     0.98   0.326    -.0241954    .0725914
              DOUBLE |  -.0495493   .0481409    -1.03   0.304    -.1443573    .0452587
              FEMALE |   .0494824   .0390936     1.27   0.207     -.027508    .1264728
               SLEEP |  -.0026737   .0015788    -1.69   0.092    -.0057829    .0004354
       INTERNATIONAL |   .0110498   .0568549     0.19   0.846    -.1009194     .123019
INTERNATIONAL_DOUBLE |   .1585559   .0799174     1.98   0.048     .0011678     .315944
             SCHOLAR |   .1079812   .0556942     1.94   0.054     -.001702    .2176644
               GREEK |   .0867959   .0611097     1.42   0.157    -.0335526    .2071443
               DRINK |   .0032886   .0034896     0.94   0.347    -.0035839     .010161
         GREEK_DRINK |  -.0123343   .0054285    -2.27   0.024     -.023025   -.0016435
             ATHLETE |   -.009831   .0417763    -0.24   0.814    -.0921047    .0724426
              FRIEND |   .0017145    .000627     2.73   0.007     .0004796    .0029494
             LN_HELP |   .0226825   .0255801     0.89   0.376    -.0276946    .0730596
            DECISION |  -.0373716   .0373309    -1.00   0.318    -.1108906    .0361473
               _cons |  -1.827059   .9206665    -1.98   0.048    -3.640205   -.0139123
--------------------------------------------------------------------------------------

. 
. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     COLLGPA |        410    3.385256     .383151        1.8          4
         SAT |        399    1305.426     152.806        110       1600
       HSGPA |        409    3.643527    .5736334        2.3       9.42
       HRSTD |        410    20.74211    16.28902          0        120
     HREXTRA |        410    14.53722     9.19345          0         50
-------------+---------------------------------------------------------
      DOUBLE |        406    .3128079    .4642089          0          1
      MAJOR1 |          0
      MAJOR2 |          0
      GENDER |          0
     HIGHSCH |          0
-------------+---------------------------------------------------------
       SLEEP |        406    50.42488    11.28634          6         76
   PRESCHOOL |        410    .7878049    .4093618          0          1
      ETHNIC |          0
      STATUS |          0
  Disability |        409    .1466993    .6285644          0         11
-------------+---------------------------------------------------------
      REGION |          0
           Q |          0
     SCHOLAR |        410     .902439    .2970826          0          1
     PAYMENT |        410    20.66073    30.17521          0        100
       GREEK |        410    .3390244    .4739565          0          1
-------------+---------------------------------------------------------
       DRINK |        410    7.290244    8.435062          0         65
    JUDICIAL |        410     .104878    .3067706          0          1
     ATHLETE |        410     .395122    .4894742          0          1
      FRIEND |        410    29.54827    30.27296          0        100
       MOMED |          0
-------------+---------------------------------------------------------
DataAnalyt~D |          0
    DECISION |        410    .4317073    .4959193          0          1
        HELP |        410    2.467073    3.170118          0         30
   SAT_HSGPA |        398    4777.556    1076.202        374    14695.2
    HRSTD_SQ |        410    694.9201    1249.562          0      14400
-------------+---------------------------------------------------------
INTERNATIO~L |        410    .2902439    .4544294          0          1
    NONWHITE |        410    .1341463    .3412259          0          1
       WHITE |        410    .5756098     .494854          0          1
 GREEK_DRINK |        410    3.709756    7.559133          0         65
DECISION_S~R |        410    .3804878    .4860999          0          1
-------------+---------------------------------------------------------
INTERNATIO~E |        406    .1305419    .3373143          0          1
      FEMALE |        408    .3602941    .4806751          0          1
 _est_Model1 |        410    .9560976    .2051284          0          1
_est_Model_1 |        410    .9560976    .2051284          0          1
      resids |        392    8.39e-11    .3080618  -1.109813    .781518
-------------+---------------------------------------------------------
      fitted |        392    3.383431    .2300005   2.372226   4.179813
    LN_HRSTD |        408    2.752463    .7914208          0   4.787492
  LNHRSTD_SQ |        408    8.200867    4.216873          0   22.92008
    LN_SLEEP |        406    3.871393    .3891319   1.791759   4.330733
     LN_HELP |        287    .9478037    .7725569  -.6931472   3.401197
-------------+---------------------------------------------------------
      LN_SAT |        399    7.164202    .1678663    4.70048   7.377759
HSGPA_SCHO~R |        409     3.30468    1.222121          0       9.42
   SAT_GREEK |        399    442.8033     621.494          0       1600
  LN_HREXTRA |        410    2.497913    .8126654          0   3.931826

. display if DECISION == 1
if not found
r(111);

. summarize DECISION

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    DECISION |        410    .4317073    .4959193          0          1

. summarize DECISION if DECISION == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    DECISION |        177           1           0          1          1

. SUMMARIZE SCHOLAR
command SUMMARIZE is unrecognized
r(199);

. summarize SCHOLAR

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     SCHOLAR |        410     .902439    .2970826          0          1

. 
. summarize SCHOLAR if SCHOLAR == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     SCHOLAR |        370           1           0          1          1

. summarize if DECISION == 1 and SCHOLAR == 1
invalid 'and' 
r(198);

. summarize if DECISION == 1 & SCHOLAR == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     COLLGPA |        156    3.316622    .3908642       2.17          4
         SAT |        153    1281.735    141.5836      756.5       1600
       HSGPA |        156    3.623332    .6049704        2.5       9.42
       HRSTD |        156    19.04285    15.78266          0         96
     HREXTRA |        156    16.41289    9.269854          0         40
-------------+---------------------------------------------------------
      DOUBLE |        152    .3223684    .4689282          0          1
      MAJOR1 |          0
      MAJOR2 |          0
      GENDER |          0
     HIGHSCH |          0
-------------+---------------------------------------------------------
       SLEEP |        152    50.42763    9.947113          6         72
   PRESCHOOL |        156    .7948718    .4050957          0          1
      ETHNIC |          0
      STATUS |          0
  Disability |        155    .1096774    .3135002          0          1
-------------+---------------------------------------------------------
      REGION |          0
           Q |          0
     SCHOLAR |        156           1           0          1          1
     PAYMENT |        156    20.48974    30.51087          0        100
       GREEK |        156    .3461538    .4772751          0          1
-------------+---------------------------------------------------------
       DRINK |        156    6.935897    7.209026          0         29
    JUDICIAL |        156    .1346154    .3424115          0          1
     ATHLETE |        156    .5384615    .5001241          0          1
      FRIEND |        156    29.86923    30.89643          0        100
       MOMED |          0
-------------+---------------------------------------------------------
DataAnalyt~D |          0
    DECISION |        156           1           0          1          1
        HELP |        156     2.25641    2.844625          0         15
   SAT_HSGPA |        153    4663.239    1123.883       2465    14695.2
    HRSTD_SQ |        156    610.1258    1110.671          0       9216
-------------+---------------------------------------------------------
INTERNATIO~L |        156    .2564103    .4380572          0          1
    NONWHITE |        156    .1602564    .3680252          0          1
       WHITE |        156    .5833333    .4945944          0          1
 GREEK_DRINK |        156    3.814103    6.941976          0         29
DECISION_S~R |        156           1           0          1          1
-------------+---------------------------------------------------------
INTERNATIO~E |        152        .125    .3318122          0          1
      FEMALE |        156    .3141026    .4656523          0          1
 _est_Model1 |        156    .9551282    .2076892          0          1
_est_Model_1 |        156    .9551282    .2076892          0          1
      resids |        149   -1.22e-10    .3204858   -1.06637   .6686109
-------------+---------------------------------------------------------
      fitted |        149     3.32492      .20459   2.657375   3.945591
    LN_HRSTD |        154    2.649191    .8206518   .6931472   4.564348
  LNHRSTD_SQ |        154    7.687307    4.292292    .480453   20.83327
    LN_SLEEP |        152    3.886624    .3177577   1.791759   4.276666
     LN_HELP |        104    .9148438     .775844  -.6931472    2.70805
-------------+---------------------------------------------------------
      LN_SAT |        153     7.14944    .1171492   6.628703   7.377759
HSGPA_SCHO~R |        156    3.623332    .6049704        2.5       9.42
   SAT_GREEK |        153    443.9869    608.5508          0       1600
  LN_HREXTRA |        156       2.627    .8210534          0   3.713572

. summarize DECISION if  DECISION == 1 & SCHOLAR == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    DECISION |        156           1           0          1          1

.  summarize SCHOLAR if  DECISION == 1 & SCHOLAR == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     SCHOLAR |        156           1           0          1          1

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK 
> GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
> RINK 

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(14, 375)      =     13.96
       Model |  19.6931272        14  1.40665194   Prob > F        =    0.0000
    Residual |  37.7770373       375  .100738766   R-squared       =    0.3427
-------------+----------------------------------   Adj R-squared   =    0.3181
       Total |  57.4701645       389  .147738212   Root MSE        =    .31739

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |     .00242   .0006265     3.86   0.000     .0011882    .0036518
               HSGPA |   .7607897   .2485895     3.06   0.002     .2719856    1.249594
           SAT_HSGPA |  -.0004524   .0001775    -2.55   0.011    -.0008015   -.0001033
            LN_HRSTD |   .1877551   .0947514     1.98   0.048     .0014445    .3740656
          LNHRSTD_SQ |  -.0230169   .0178146    -1.29   0.197    -.0580458    .0120121
             HREXTRA |   -.001817   .0018232    -1.00   0.320    -.0054019     .001768
              DOUBLE |  -.0109567   .0453783    -0.24   0.809    -.1001844     .078271
              FEMALE |   .1068917   .0350143     3.05   0.002     .0380427    .1757408
               SLEEP |  -.0023357   .0015261    -1.53   0.127    -.0053366    .0006651
       INTERNATIONAL |  -.0552447   .0491495    -1.12   0.262    -.1518879    .0413985
INTERNATIONAL_DOUBLE |   .2104451   .0748891     2.81   0.005       .06319    .3577003
             SCHOLAR |    .100462   .0546803     1.84   0.067    -.0070565    .2079804
               GREEK |  -.0041627   .0379494    -0.11   0.913    -.0787831    .0704576
               DRINK |   .0023218   .0021833     1.06   0.288    -.0019713    .0066148
               _cons |  -.7237509   .8561247    -0.85   0.398    -2.407158    .9596557
--------------------------------------------------------------------------------------

. GREEK_DRINK ATHLETE FRIEND DECISION HELP
command GREEK_DRINK is unrecognized
r(199);

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK D
> RINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     11.17
       Model |  20.9432322        19  1.10227538   Prob > F        =    0.0000
    Residual |  36.5269323       370  .098721439   R-squared       =    0.3644
-------------+----------------------------------   Adj R-squared   =    0.3318
       Total |  57.4701645       389  .147738212   Root MSE        =     .3142

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024601    .000627     3.92   0.000     .0012273     .003693
               HSGPA |   .7969996   .2479976     3.21   0.001     .3093382    1.284661
           SAT_HSGPA |  -.0004749   .0001772    -2.68   0.008    -.0008233   -.0001264
            LN_HRSTD |   .1974597   .0951842     2.07   0.039     .0102897    .3846296
          LNHRSTD_SQ |  -.0274332   .0180016    -1.52   0.128    -.0628315    .0079652
             HREXTRA |  -.0007058   .0020406    -0.35   0.730    -.0047184    .0033068
              DOUBLE |  -.0083263   .0452403    -0.18   0.854    -.0972866     .080634
              FEMALE |   .1023274   .0349922     2.92   0.004     .0335188     .171136
               SLEEP |  -.0025677   .0015224    -1.69   0.093    -.0055613     .000426
       INTERNATIONAL |   -.055461   .0488485    -1.14   0.257    -.1515165    .0405944
INTERNATIONAL_DOUBLE |   .2043953   .0751928     2.72   0.007     .0565364    .3522542
             SCHOLAR |   .1159999   .0554918     2.09   0.037     .0068811    .2251187
               GREEK |   .0587055   .0524369     1.12   0.264    -.0444062    .1618172
               DRINK |   .0055252   .0030315     1.82   0.069     -.000436    .0114864
         GREEK_DRINK |   -.006971   .0041317    -1.69   0.092    -.0150956    .0011535
             ATHLETE |  -.0323136   .0394197    -0.82   0.413    -.1098284    .0452013
              FRIEND |   .0014102   .0005617     2.51   0.012     .0003057    .0025147
            DECISION |   -.057326   .0339602    -1.69   0.092    -.1241052    .0094532
                HELP |    .002148   .0055515     0.39   0.699    -.0087684    .0130644
               _cons |  -.8354382   .8596329    -0.97   0.332    -2.525817    .8549406
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIE
> ND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. 
. estimates store Model_2

. estout Model_1 Model_2 using Modelstable.txt, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3)) append
estimation result Model_1 not found
r(111);

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SC
> HOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. estimates store Model_1

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. 
. estimates store Model_2

.  estout Model_1 Model_2 using Modelstable.txt, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3)) append
(output written to Modelstable.txt)

. esttab

----------------------------
                      (1)   
                  COLLGPA   
----------------------------
SAT               0.00246***
                   (3.92)   

HSGPA               0.811** 
                   (3.26)   

SAT_HSGPA       -0.000480** 
                  (-2.71)   

LN_HRSTD           0.0569*  
                   (2.42)   

HREXTRA         -0.000762   
                  (-0.37)   

DOUBLE           -0.00779   
                  (-0.17)   

FEMALE             0.0985** 
                   (2.82)   

SLEEP            -0.00271   
                  (-1.78)   

INTERNATIO~L      -0.0540   
                  (-1.10)   

INTERNATIO~E        0.198** 
                   (2.63)   

SCHOLAR             0.117*  
                   (2.10)   

GREEK              0.0651   
                   (1.24)   

DRINK             0.00557   
                   (1.83)   

GREEK_DRINK      -0.00732   
                  (-1.77)   

ATHLETE           -0.0279   
                  (-0.71)   

FRIEND            0.00127*  
                   (2.29)   

DECISION          -0.0606   
                  (-1.79)   

HELP              0.00181   
                   (0.33)   

_cons              -0.686   
                  (-0.80)   
----------------------------
N                     390   
----------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. esttab Model_1 Model_2, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3))

--------------------------------------------
                      (1)             (2)   
                  COLLGPA         COLLGPA   
                     b/se            b/se   
--------------------------------------------
SAT                 0.003***        0.002***
                  (0.001)         (0.001)   
HSGPA               0.835***        0.811** 
                  (0.251)         (0.248)   
SAT_HSGPA          -0.000**        -0.000** 
                  (0.000)         (0.000)   
HRSTD               0.005                   
                  (0.003)                   
HRSTD_SQ           -0.000                   
                  (0.000)                   
HREXTRA            -0.000          -0.001   
                  (0.002)         (0.002)   
DOUBLE             -0.010          -0.008   
                  (0.046)         (0.045)   
FEMALE              0.102**         0.099** 
                  (0.035)         (0.035)   
SLEEP              -0.003          -0.003   
                  (0.002)         (0.002)   
INTERNATIO~L       -0.050          -0.054   
                  (0.049)         (0.049)   
INTERNATIO~E        0.195*          0.198** 
                  (0.076)         (0.075)   
SCHOLAR             0.136           0.117*  
                  (0.078)         (0.056)   
GREEK               0.062           0.065   
                  (0.053)         (0.052)   
DRINK               0.005           0.006   
                  (0.003)         (0.003)   
GREEK_DRINK        -0.007          -0.007   
                  (0.004)         (0.004)   
ATHLETE            -0.030          -0.028   
                  (0.040)         (0.039)   
FRIEND              0.001*          0.001*  
                  (0.001)         (0.001)   
DECISION           -0.029          -0.061   
                  (0.104)         (0.034)   
DECISION_S~R       -0.037                   
                  (0.109)                   
HELP                0.003           0.002   
                  (0.006)         (0.006)   
LN_HRSTD                            0.057*  
                                  (0.024)   
_cons              -0.716          -0.686   
                  (0.876)         (0.856)   
--------------------------------------------
R-squared           0.358           0.360   
Adjusted R~d                                
N                 392.000         390.000   
--------------------------------------------

. 
. esttab Model_1 Model_2, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3)) mlabels("Model_1" "Model_2")

--------------------------------------------
                      (1)             (2)   
                  Model_1         Model_2   
                     b/se            b/se   
--------------------------------------------
SAT                 0.003***        0.002***
                  (0.001)         (0.001)   
HSGPA               0.835***        0.811** 
                  (0.251)         (0.248)   
SAT_HSGPA          -0.000**        -0.000** 
                  (0.000)         (0.000)   
HRSTD               0.005                   
                  (0.003)                   
HRSTD_SQ           -0.000                   
                  (0.000)                   
HREXTRA            -0.000          -0.001   
                  (0.002)         (0.002)   
DOUBLE             -0.010          -0.008   
                  (0.046)         (0.045)   
FEMALE              0.102**         0.099** 
                  (0.035)         (0.035)   
SLEEP              -0.003          -0.003   
                  (0.002)         (0.002)   
INTERNATIO~L       -0.050          -0.054   
                  (0.049)         (0.049)   
INTERNATIO~E        0.195*          0.198** 
                  (0.076)         (0.075)   
SCHOLAR             0.136           0.117*  
                  (0.078)         (0.056)   
GREEK               0.062           0.065   
                  (0.053)         (0.052)   
DRINK               0.005           0.006   
                  (0.003)         (0.003)   
GREEK_DRINK        -0.007          -0.007   
                  (0.004)         (0.004)   
ATHLETE            -0.030          -0.028   
                  (0.040)         (0.039)   
FRIEND              0.001*          0.001*  
                  (0.001)         (0.001)   
DECISION           -0.029          -0.061   
                  (0.104)         (0.034)   
DECISION_S~R       -0.037                   
                  (0.109)                   
HELP                0.003           0.002   
                  (0.006)         (0.006)   
LN_HRSTD                            0.057*  
                                  (0.024)   
_cons              -0.716          -0.686   
                  (0.876)         (0.856)   
--------------------------------------------
R-squared           0.358           0.360   
Adjusted R~d                                
N                 392.000         390.000   
--------------------------------------------

. 
. estout Model_1 Model_2, cells(b(star fmt(3)) se(par fmt(3))) stats(r2 ar2 N, labels("R-squared" "Adjusted R-squared" "N") fmt(3) columns(4 4 4)) mlabels("Model_1" "Model_2")
option columns() not allowed
r(198);

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    144.93    0.006900
       HSGPA |     81.87    0.012215
         SAT |     36.34    0.027518
 GREEK_DRINK |      3.94    0.253552
       DRINK |      2.61    0.382765
INTERNATIO~E |      2.57    0.388671
       GREEK |      2.42    0.413820
INTERNATIO~L |      1.94    0.515681
      DOUBLE |      1.75    0.570359
     ATHLETE |      1.45    0.690334
    LN_HRSTD |      1.38    0.723109
     HREXTRA |      1.35    0.740980
        HELP |      1.26    0.794943
      FEMALE |      1.12    0.889614
     SCHOLAR |      1.12    0.893114
    DECISION |      1.11    0.898795
       SLEEP |      1.08    0.925823
      FRIEND |      1.07    0.930319
-------------+----------------------
    Mean VIF |     16.07

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   1.82
Prob > chi2 = 0.1779

. votest
command votest is unrecognized
r(199);

. ovtest

Ramsey RESET test for omitted variables
Omitted: Powers of fitted values of COLLGPA

H0: Model has no omitted variables

F(3, 368) =   7.32
 Prob > F = 0.0001

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEN
> D DECISION LN_HELP

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(18, 254)      =      9.15
       Model |  14.0661527        18  .781452925   Prob > F        =    0.0000
    Residual |  21.6874117       254  .085383511   R-squared       =    0.3934
-------------+----------------------------------   Adj R-squared   =    0.3504
       Total |  35.7535644       272  .131446928   Root MSE        =     .2922

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028515   .0006664     4.28   0.000     .0015392    .0041638
               HSGPA |   1.091651   .2651375     4.12   0.000     .5695029    1.613799
           SAT_HSGPA |   -.000636   .0001863    -3.41   0.001    -.0010028   -.0002691
            LN_HRSTD |     .06922   .0283585     2.44   0.015     .0133722    .1250678
             HREXTRA |  -.0006426   .0022451    -0.29   0.775    -.0050639    .0037787
              DOUBLE |  -.0479069   .0487537    -0.98   0.327    -.1439199    .0481062
              FEMALE |   .0381618   .0395761     0.96   0.336    -.0397772    .1161008
               SLEEP |  -.0030558   .0015927    -1.92   0.056    -.0061924    .0000809
       INTERNATIONAL |   .0042907   .0575094     0.07   0.941    -.1089653    .1175468
INTERNATIONAL_DOUBLE |   .1547023   .0809575     1.91   0.057    -.0047313    .3141358
             SCHOLAR |   .1035776   .0565894     1.83   0.068    -.0078667    .2150218
               GREEK |   .0871484   .0621219     1.40   0.162    -.0351913    .2094881
               DRINK |   .0042705   .0035186     1.21   0.226    -.0026589    .0111998
         GREEK_DRINK |  -.0126589   .0055122    -2.30   0.022    -.0235143   -.0018035
             ATHLETE |   .0126086   .0438609     0.29   0.774    -.0737687     .098986
              FRIEND |   .0014594   .0006254     2.33   0.020     .0002278     .002691
            DECISION |  -.0361505   .0378539    -0.96   0.340    -.1106981     .038397
             LN_HELP |   .0257683   .0259975     0.99   0.323    -.0254299    .0769665
               _cons |   -1.48973   .9252164    -1.61   0.109    -3.311802    .3323427
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK
>  ATHLETE FRIEND LN_HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(19, 253)      =      9.31
       Model |  14.7074696        19  .774077346   Prob > F        =    0.0000
    Residual |  21.0460948       253  .083186146   R-squared       =    0.4114
-------------+----------------------------------   Adj R-squared   =    0.3672
       Total |  35.7535644       272  .131446928   Root MSE        =    .28842

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028009   .0006579     4.26   0.000     .0015053    .0040965
               HSGPA |    1.04087   .2623745     3.97   0.000     .5241538    1.557587
           SAT_HSGPA |   -.000617   .0001839    -3.35   0.001    -.0009792   -.0002548
            LN_HRSTD |   .3986113   .1253568     3.18   0.002     .1517355    .6454871
          LNHRSTD_SQ |  -.0611627   .0225158    -2.72   0.007     -.105505   -.0168204
          LN_HREXTRA |    .024198   .0245728     0.98   0.326    -.0241954    .0725914
              DOUBLE |  -.0495493   .0481409    -1.03   0.304    -.1443573    .0452587
              FEMALE |   .0494824   .0390936     1.27   0.207     -.027508    .1264728
               SLEEP |  -.0026737   .0015788    -1.69   0.092    -.0057829    .0004354
       INTERNATIONAL |   .0110498   .0568549     0.19   0.846    -.1009194     .123019
INTERNATIONAL_DOUBLE |   .1585559   .0799174     1.98   0.048     .0011678     .315944
             SCHOLAR |   .1079812   .0556942     1.94   0.054     -.001702    .2176644
               GREEK |   .0867959   .0611097     1.42   0.157    -.0335526    .2071443
               DRINK |   .0032886   .0034896     0.94   0.347    -.0035839     .010161
         GREEK_DRINK |  -.0123343   .0054285    -2.27   0.024     -.023025   -.0016435
             ATHLETE |   -.009831   .0417763    -0.24   0.814    -.0921047    .0724426
              FRIEND |   .0017145    .000627     2.73   0.007     .0004796    .0029494
             LN_HELP |   .0226825   .0255801     0.89   0.376    -.0276946    .0730596
            DECISION |  -.0373716   .0373309    -1.00   0.318    -.1108906    .0361473
               _cons |  -1.827059   .9206665    -1.98   0.048    -3.640205   -.0139123
--------------------------------------------------------------------------------------

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    122.62    0.008155
       HSGPA |     66.24    0.015097
         SAT |     35.81    0.027928
  LNHRSTD_SQ |     28.73    0.034809
    LN_HRSTD |     27.82    0.035947
 GREEK_DRINK |      3.81    0.262604
INTERNATIO~E |      2.83    0.352893
       GREEK |      2.72    0.367182
INTERNATIO~L |      2.24    0.445498
       DRINK |      2.14    0.467388
      DOUBLE |      1.77    0.566420
     ATHLETE |      1.32    0.755386
     LN_HELP |      1.28    0.778611
  LN_HREXTRA |      1.22    0.817158
      FEMALE |      1.19    0.839420
      FRIEND |      1.14    0.878978
    DECISION |      1.12    0.892824
     SCHOLAR |      1.11    0.900985
       SLEEP |      1.09    0.921289
-------------+----------------------
    Mean VIF |     16.12

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   6.26
Prob > chi2 = 0.0124

. 
. . reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK FRIEND LN_HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(18, 254)      =      9.86
       Model |  14.7028629        18  .816825716   Prob > F        =    0.0000
    Residual |  21.0507015       254  .082876778   R-squared       =    0.4112
-------------+----------------------------------   Adj R-squared   =    0.3695
       Total |  35.7535644       272  .131446928   Root MSE        =    .28788

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0027983   .0006565     4.26   0.000     .0015053    .0040912
               HSGPA |   1.040303   .2618751     3.97   0.000     .5245797    1.556026
           SAT_HSGPA |  -.0006161   .0001835    -3.36   0.001    -.0009775   -.0002547
            LN_HRSTD |    .396804   .1248885     3.18   0.002     .1508552    .6427527
          LNHRSTD_SQ |  -.0606956   .0223864    -2.71   0.007    -.1047822   -.0166089
          LN_HREXTRA |   .0225179    .023469     0.96   0.338    -.0237008    .0687366
              DOUBLE |  -.0492628    .048036    -1.03   0.306    -.1438623    .0453367
              FEMALE |    .050175   .0389102     1.29   0.198    -.0264527    .1268026
               SLEEP |  -.0026759   .0015758    -1.70   0.091    -.0057792    .0004274
       INTERNATIONAL |   .0122464   .0565217     0.22   0.829    -.0990645    .1235572
INTERNATIONAL_DOUBLE |   .1583462   .0797637     1.99   0.048     .0012637    .3154286
             SCHOLAR |   .1050501   .0541825     1.94   0.054     -.001654    .2117542
               GREEK |   .0854589   .0607318     1.41   0.161    -.0341431    .2050608
               DRINK |   .0031529   .0034352     0.92   0.360    -.0036123     .009918
         GREEK_DRINK |  -.0121734   .0053753    -2.26   0.024    -.0227592   -.0015877
              FRIEND |   .0017062   .0006249     2.73   0.007     .0004756    .0029368
             LN_HELP |   .0227037   .0255323     0.89   0.375    -.0275784    .0729857
            DECISION |  -.0380883   .0371372    -1.03   0.306    -.1112245    .0350478
               _cons |  -1.820915   .9185833    -1.98   0.049    -3.629925   -.0119051
--------------------------------------------------------------------------------------

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    122.57    0.008159
       HSGPA |     66.23    0.015099
         SAT |     35.80    0.027936
  LNHRSTD_SQ |     28.51    0.035081
    LN_HRSTD |     27.71    0.036083
 GREEK_DRINK |      3.75    0.266834
INTERNATIO~E |      2.83    0.352937
       GREEK |      2.70    0.370383
INTERNATIO~L |      2.23    0.449090
       DRINK |      2.08    0.480514
      DOUBLE |      1.76    0.566783
     LN_HELP |      1.28    0.778621
      FEMALE |      1.18    0.844204
      FRIEND |      1.13    0.881786
  LN_HREXTRA |      1.12    0.892499
    DECISION |      1.11    0.898805
       SLEEP |      1.09    0.921321
     SCHOLAR |      1.05    0.948421
-------------+----------------------
    Mean VIF |     16.90

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRIN
> K FRIEND LN_HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(18, 254)      =      9.86
       Model |  14.7028629        18  .816825716   Prob > F        =    0.0000
    Residual |  21.0507015       254  .082876778   R-squared       =    0.4112
-------------+----------------------------------   Adj R-squared   =    0.3695
       Total |  35.7535644       272  .131446928   Root MSE        =    .28788

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0027983   .0006565     4.26   0.000     .0015053    .0040912
               HSGPA |   1.040303   .2618751     3.97   0.000     .5245797    1.556026
           SAT_HSGPA |  -.0006161   .0001835    -3.36   0.001    -.0009775   -.0002547
            LN_HRSTD |    .396804   .1248885     3.18   0.002     .1508552    .6427527
          LNHRSTD_SQ |  -.0606956   .0223864    -2.71   0.007    -.1047822   -.0166089
          LN_HREXTRA |   .0225179    .023469     0.96   0.338    -.0237008    .0687366
              DOUBLE |  -.0492628    .048036    -1.03   0.306    -.1438623    .0453367
              FEMALE |    .050175   .0389102     1.29   0.198    -.0264527    .1268026
               SLEEP |  -.0026759   .0015758    -1.70   0.091    -.0057792    .0004274
       INTERNATIONAL |   .0122464   .0565217     0.22   0.829    -.0990645    .1235572
INTERNATIONAL_DOUBLE |   .1583462   .0797637     1.99   0.048     .0012637    .3154286
             SCHOLAR |   .1050501   .0541825     1.94   0.054     -.001654    .2117542
               GREEK |   .0854589   .0607318     1.41   0.161    -.0341431    .2050608
               DRINK |   .0031529   .0034352     0.92   0.360    -.0036123     .009918
         GREEK_DRINK |  -.0121734   .0053753    -2.26   0.024    -.0227592   -.0015877
              FRIEND |   .0017062   .0006249     2.73   0.007     .0004756    .0029368
             LN_HELP |   .0227037   .0255323     0.89   0.375    -.0275784    .0729857
            DECISION |  -.0380883   .0371372    -1.03   0.306    -.1112245    .0350478
               _cons |  -1.820915   .9185833    -1.98   0.049    -3.629925   -.0119051
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK FRIEND LN
> _HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(17, 255)      =      9.76
       Model |  14.0936376        17  .829037507   Prob > F        =    0.0000
    Residual |  21.6599268       255  .084940889   R-squared       =    0.3942
-------------+----------------------------------   Adj R-squared   =    0.3538
       Total |  35.7535644       272  .131446928   Root MSE        =    .29145

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028485   .0006644     4.29   0.000     .0015401    .0041569
               HSGPA |    1.08712   .2645392     4.11   0.000     .5661602     1.60808
           SAT_HSGPA |  -.0006361   .0001856    -3.43   0.001    -.0010017   -.0002705
            LN_HRSTD |   .0665684   .0279388     2.38   0.018     .0115483    .1215884
          LN_HREXTRA |   .0157204   .0236235     0.67   0.506    -.0308017    .0622424
              DOUBLE |  -.0526491    .048614    -1.08   0.280    -.1483852     .043087
              FEMALE |   .0403149   .0392193     1.03   0.305    -.0369201    .1175498
               SLEEP |  -.0029725   .0015914    -1.87   0.063    -.0061065    .0001616
       INTERNATIONAL |   .0070987   .0571889     0.12   0.901    -.1055241    .1197214
INTERNATIONAL_DOUBLE |   .1549664    .080741     1.92   0.056    -.0040378    .3139705
             SCHOLAR |   .1072765   .0548467     1.96   0.052    -.0007338    .2152868
               GREEK |   .0915928   .0614407     1.49   0.137    -.0294031    .2125886
               DRINK |   .0042968   .0034514     1.24   0.214    -.0025001    .0110938
         GREEK_DRINK |  -.0130018    .005433    -2.39   0.017     -.023701   -.0023026
              FRIEND |    .001433   .0006243     2.30   0.023     .0002035    .0026625
             LN_HELP |   .0235009   .0258466     0.91   0.364    -.0273991    .0744009
            DECISION |  -.0405951   .0375852    -1.08   0.281    -.1146121    .0334218
               _cons |   -1.50866   .9226139    -1.64   0.103    -3.325574    .3082531
--------------------------------------------------------------------------------------

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK FRIEND LN_HELP DECISI
> ON

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(16, 256)      =     10.37
       Model |  14.0560234        16  .878501461   Prob > F        =    0.0000
    Residual |   21.697541       256   .08475602   R-squared       =    0.3931
-------------+----------------------------------   Adj R-squared   =    0.3552
       Total |  35.7535644       272  .131446928   Root MSE        =    .29113

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028597   .0006635     4.31   0.000     .0015532    .0041663
               HSGPA |   1.093826   .2640594     4.14   0.000     .5738207    1.613831
           SAT_HSGPA |  -.0006389   .0001854    -3.45   0.001     -.001004   -.0002738
            LN_HRSTD |   .0676045    .027865     2.43   0.016     .0127308    .1224782
              DOUBLE |  -.0493447   .0483071    -1.02   0.308    -.1444746    .0457852
              FEMALE |   .0384144   .0390726     0.98   0.326    -.0385302     .115359
               SLEEP |  -.0030473   .0015857    -1.92   0.056    -.0061701    .0000754
       INTERNATIONAL |   .0036137   .0568866     0.06   0.949    -.1084116    .1156391
INTERNATIONAL_DOUBLE |   .1550419    .080653     1.92   0.056     -.003786    .3138698
             SCHOLAR |   .1074719   .0547862     1.96   0.051    -.0004172     .215361
               GREEK |   .0900273   .0613288     1.47   0.143     -.030746    .2108005
               DRINK |   .0044394    .003441     1.29   0.198    -.0023369    .0112157
         GREEK_DRINK |  -.0129384   .0054262    -2.38   0.018    -.0236241   -.0022527
              FRIEND |   .0014649   .0006218     2.36   0.019     .0002404    .0026894
             LN_HELP |   .0250121   .0257186     0.97   0.332    -.0256349    .0756591
            DECISION |   -.036751   .0370982    -0.99   0.323    -.1098075    .0363055
               _cons |   -1.49823   .9214763    -1.63   0.105    -3.312869    .3164094
--------------------------------------------------------------------------------------

. 
.   reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK FRIEND LN_HELP DECISION

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(16, 256)      =     10.37
       Model |  14.0560234        16  .878501461   Prob > F        =    0.0000
    Residual |   21.697541       256   .08475602   R-squared       =    0.3931
-------------+----------------------------------   Adj R-squared   =    0.3552
       Total |  35.7535644       272  .131446928   Root MSE        =    .29113

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028597   .0006635     4.31   0.000     .0015532    .0041663
               HSGPA |   1.093826   .2640594     4.14   0.000     .5738207    1.613831
           SAT_HSGPA |  -.0006389   .0001854    -3.45   0.001     -.001004   -.0002738
            LN_HRSTD |   .0676045    .027865     2.43   0.016     .0127308    .1224782
              DOUBLE |  -.0493447   .0483071    -1.02   0.308    -.1444746    .0457852
              FEMALE |   .0384144   .0390726     0.98   0.326    -.0385302     .115359
               SLEEP |  -.0030473   .0015857    -1.92   0.056    -.0061701    .0000754
       INTERNATIONAL |   .0036137   .0568866     0.06   0.949    -.1084116    .1156391
INTERNATIONAL_DOUBLE |   .1550419    .080653     1.92   0.056     -.003786    .3138698
             SCHOLAR |   .1074719   .0547862     1.96   0.051    -.0004172     .215361
               GREEK |   .0900273   .0613288     1.47   0.143     -.030746    .2108005
               DRINK |   .0044394    .003441     1.29   0.198    -.0023369    .0112157
         GREEK_DRINK |  -.0129384   .0054262    -2.38   0.018    -.0236241   -.0022527
              FRIEND |   .0014649   .0006218     2.36   0.019     .0002404    .0026894
             LN_HELP |   .0250121   .0257186     0.97   0.332    -.0256349    .0756591
            DECISION |   -.036751   .0370982    -0.99   0.323    -.1098075    .0363055
               _cons |   -1.49823   .9214763    -1.63   0.105    -3.312869    .3164094
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE LN_SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.61
       Model |  20.7116402        18  1.15064668   Prob > F        =    0.0000
    Residual |  36.7585243       371   .09907958   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31477

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024449   .0006269     3.90   0.000     .0012122    .0036775
               HSGPA |   .8013444   .2476709     3.24   0.001     .3143296    1.288359
           SAT_HSGPA |   -.000474    .000177    -2.68   0.008    -.0008221   -.0001259
            LN_HRSTD |   .0562728   .0235509     2.39   0.017     .0099629    .1025828
             HREXTRA |  -.0005742   .0020444    -0.28   0.779    -.0045943    .0034458
              DOUBLE |   -.005918   .0453003    -0.13   0.896    -.0949956    .0831595
              FEMALE |   .0971757   .0349954     2.78   0.006     .0283614    .1659899
            LN_SLEEP |  -.0789312   .0444723    -1.77   0.077    -.1663805    .0085182
       INTERNATIONAL |  -.0519024   .0490043    -1.06   0.290    -.1482635    .0444587
INTERNATIONAL_DOUBLE |   .1923898   .0752493     2.56   0.011     .0444211    .3403585
             SCHOLAR |   .1201875   .0556504     2.16   0.031     .0107577    .2296174
               GREEK |   .0628452   .0522582     1.20   0.230    -.0399142    .1656046
               DRINK |    .005401   .0030263     1.78   0.075    -.0005498    .0113518
         GREEK_DRINK |  -.0072592   .0041311    -1.76   0.080    -.0153826    .0008642
             ATHLETE |   -.031032   .0393962    -0.79   0.431    -.1084999    .0464359
              FRIEND |   .0012331   .0005543     2.22   0.027     .0001431    .0023231
            DECISION |  -.0591604   .0339554    -1.74   0.082    -.1259296    .0076089
                HELP |   .0013537   .0055885     0.24   0.809    -.0096354    .0123428
               _cons |  -.4917571    .856184    -0.57   0.566    -2.175339    1.191825
--------------------------------------------------------------------------------------

. gen SLEEP_SQ = SLEEP^2
(4 missing values generated)

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP_SQ INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DEC
> ISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.59
       Model |   20.685446        18  1.14919144   Prob > F        =    0.0000
    Residual |  36.7847185       371  .099150185   R-squared       =    0.3599
-------------+----------------------------------   Adj R-squared   =    0.3289
       Total |  57.4701645       389  .147738212   Root MSE        =    .31488

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024491   .0006279     3.90   0.000     .0012143    .0036838
               HSGPA |   .8075026   .2483454     3.25   0.001     .3191614    1.295844
           SAT_HSGPA |  -.0004779   .0001775    -2.69   0.007    -.0008269   -.0001288
            LN_HRSTD |   .0571034   .0235681     2.42   0.016     .0107596    .1034472
             HREXTRA |  -.0008825   .0020476    -0.43   0.667    -.0049088    .0031439
              DOUBLE |   -.008878   .0453646    -0.20   0.845    -.0980819     .080326
              FEMALE |   .0998918   .0349677     2.86   0.005     .0311319    .1686516
            SLEEP_SQ |  -.0000302   .0000178    -1.70   0.090    -.0000651    4.77e-06
       INTERNATIONAL |  -.0561879   .0488986    -1.15   0.251    -.1523412    .0399653
INTERNATIONAL_DOUBLE |   .2022044   .0752998     2.69   0.008     .0541365    .3502722
             SCHOLAR |   .1136004     .05562     2.04   0.042     .0042304    .2229704
               GREEK |   .0656055   .0524343     1.25   0.212    -.0375003    .1687113
               DRINK |   .0056065   .0030436     1.84   0.066    -.0003784    .0115914
         GREEK_DRINK |  -.0073484   .0041352    -1.78   0.076    -.0154799     .000783
             ATHLETE |  -.0258554   .0394339    -0.66   0.512    -.1033974    .0516865
              FRIEND |   .0012833    .000556     2.31   0.022       .00019    .0023766
            DECISION |  -.0614274    .033971    -1.81   0.071    -.1282272    .0053725
                HELP |   .0022517   .0055411     0.41   0.685    -.0086442    .0131476
               _cons |  -.7255757   .8577333    -0.85   0.398    -2.412204     .961053
--------------------------------------------------------------------------------------

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP SLEEP_SQ INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIE
> ND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     10.97
       Model |  20.7144034        19  1.09023176   Prob > F        =    0.0000
    Residual |  36.7557611       370  .099339895   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3276
       Total |  57.4701645       389  .147738212   Root MSE        =    .31518

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024611   .0006289     3.91   0.000     .0012244    .0036979
               HSGPA |   .8103422   .2486385     3.26   0.001     .3214204    1.299264
           SAT_HSGPA |  -.0004803   .0001777    -2.70   0.007    -.0008298   -.0001308
            LN_HRSTD |   .0568609   .0235949     2.41   0.016     .0104639    .1032578
             HREXTRA |  -.0007433   .0020657    -0.36   0.719    -.0048053    .0033187
              DOUBLE |  -.0076064    .045469    -0.17   0.867    -.0970165    .0818037
              FEMALE |   .0983556   .0351166     2.80   0.005     .0293024    .1674088
               SLEEP |  -.0030759    .005697    -0.54   0.590    -.0142784    .0081267
            SLEEP_SQ |   4.41e-06   .0000665     0.07   0.947    -.0001264    .0001352
       INTERNATIONAL |  -.0537439   .0491543    -1.09   0.275    -.1504006    .0429129
INTERNATIONAL_DOUBLE |   .1973087   .0759152     2.60   0.010     .0480293    .3465882
             SCHOLAR |   .1169318   .0560141     2.09   0.038      .006786    .2270777
               GREEK |   .0649381    .052499     1.24   0.217    -.0382958     .168172
               DRINK |   .0055549    .003048     1.82   0.069    -.0004388    .0115485
         GREEK_DRINK |  -.0073176   .0041396    -1.77   0.078    -.0154576    .0008225
             ATHLETE |  -.0281738   .0397045    -0.71   0.478    -.1062485    .0499009
              FRIEND |   .0012682   .0005572     2.28   0.023     .0001724    .0023639
            DECISION |  -.0605216   .0340449    -1.78   0.076    -.1274673    .0064241
                HELP |   .0017578   .0056213     0.31   0.755     -.009296    .0128116
               _cons |  -.6786782   .8629364    -0.79   0.432    -2.375553    1.018197
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION LN_HELP

      Source |       SS           df       MS      Number of obs   =       273
-------------+----------------------------------   F(18, 254)      =      9.15
       Model |  14.0661527        18  .781452925   Prob > F        =    0.0000
    Residual |  21.6874117       254  .085383511   R-squared       =    0.3934
-------------+----------------------------------   Adj R-squared   =    0.3504
       Total |  35.7535644       272  .131446928   Root MSE        =     .2922

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0028515   .0006664     4.28   0.000     .0015392    .0041638
               HSGPA |   1.091651   .2651375     4.12   0.000     .5695029    1.613799
           SAT_HSGPA |   -.000636   .0001863    -3.41   0.001    -.0010028   -.0002691
            LN_HRSTD |     .06922   .0283585     2.44   0.015     .0133722    .1250678
             HREXTRA |  -.0006426   .0022451    -0.29   0.775    -.0050639    .0037787
              DOUBLE |  -.0479069   .0487537    -0.98   0.327    -.1439199    .0481062
              FEMALE |   .0381618   .0395761     0.96   0.336    -.0397772    .1161008
               SLEEP |  -.0030558   .0015927    -1.92   0.056    -.0061924    .0000809
       INTERNATIONAL |   .0042907   .0575094     0.07   0.941    -.1089653    .1175468
INTERNATIONAL_DOUBLE |   .1547023   .0809575     1.91   0.057    -.0047313    .3141358
             SCHOLAR |   .1035776   .0565894     1.83   0.068    -.0078667    .2150218
               GREEK |   .0871484   .0621219     1.40   0.162    -.0351913    .2094881
               DRINK |   .0042705   .0035186     1.21   0.226    -.0026589    .0111998
         GREEK_DRINK |  -.0126589   .0055122    -2.30   0.022    -.0235143   -.0018035
             ATHLETE |   .0126086   .0438609     0.29   0.774    -.0737687     .098986
              FRIEND |   .0014594   .0006254     2.33   0.020     .0002278     .002691
            DECISION |  -.0361505   .0378539    -0.96   0.340    -.1106981     .038397
             LN_HELP |   .0257683   .0259975     0.99   0.323    -.0254299    .0769665
               _cons |   -1.48973   .9252164    -1.61   0.109    -3.311802    .3323427
--------------------------------------------------------------------------------------

. corr
(MAJOR1 ignored because string variable)
(MAJOR2 ignored because string variable)
(GENDER ignored because string variable)
(HIGHSCH ignored because string variable)
(ETHNIC ignored because string variable)
(STATUS ignored because string variable)
(REGION ignored because string variable)
(Q ignored because string variable)
(MOMED ignored because string variable)
(DataAnalyticsDED ignored because string variable)
(obs=272)

             |  COLLGPA      SAT    HSGPA    HRSTD  HREXTRA   DOUBLE    SLEEP PRESCH~L Disabi~y  SCHOLAR  PAYMENT    GREEK    DRINK JUDICIAL  ATHLETE   FRIEND DECISION     HELP
-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------
     COLLGPA |   1.0000
         SAT |   0.4107   1.0000
       HSGPA |   0.3797   0.2434   1.0000
       HRSTD |   0.2032   0.2406  -0.0188   1.0000
     HREXTRA |   0.0500   0.0906   0.1184   0.1349   1.0000
      DOUBLE |   0.1064   0.1826   0.0679   0.0925   0.1142   1.0000
       SLEEP |  -0.0803   0.0314  -0.0684   0.0777  -0.0337  -0.0865   1.0000
   PRESCHOOL |  -0.0047  -0.0130   0.1366  -0.2912   0.0304  -0.1209   0.0300   1.0000
  Disability |  -0.0745   0.0395  -0.0669  -0.0108   0.0060   0.0776   0.0021   0.0362   1.0000
     SCHOLAR |   0.1511   0.0291   0.0978  -0.0363  -0.0123   0.0318  -0.0087   0.0607  -0.0000   1.0000
     PAYMENT |   0.0155   0.0466  -0.0041   0.3550   0.2392   0.1306  -0.1629  -0.1087   0.0233  -0.0107   1.0000
       GREEK |  -0.0675  -0.0277   0.0025  -0.0286   0.0348  -0.0020   0.0988   0.1806   0.0099  -0.0854  -0.0051   1.0000
       DRINK |  -0.1647  -0.1367  -0.1672  -0.1567   0.0581  -0.1897   0.1375   0.1957  -0.0254  -0.0326   0.0176   0.3350   1.0000
    JUDICIAL |  -0.1326   0.0274   0.0027  -0.0581  -0.0139   0.0264   0.0079   0.0434   0.0112  -0.0089  -0.0061   0.1235   0.1215   1.0000
     ATHLETE |  -0.0662  -0.1076  -0.0679  -0.1850   0.3584  -0.0743   0.0098   0.2087   0.0176   0.1910   0.0443   0.1008   0.2288   0.0047   1.0000
      FRIEND |   0.0954   0.0552  -0.1564   0.2152   0.0574   0.0159   0.0658  -0.1398  -0.0217  -0.1117   0.1628   0.0212   0.0542   0.0409   0.0457   1.0000
    DECISION |  -0.1461  -0.1396  -0.0210  -0.0280   0.1715   0.0275   0.0472  -0.0098  -0.0348  -0.0787   0.0137   0.1448   0.0259   0.0523   0.1116   0.0817   1.0000
        HELP |   0.1699   0.1720  -0.0746   0.2609   0.1379   0.1161  -0.0378  -0.1088  -0.0003  -0.0247   0.2918   0.1140   0.1087  -0.0365  -0.0487   0.0969  -0.0358   1.0000
   SAT_HSGPA |   0.4748   0.7055   0.8527   0.1058   0.1370   0.1555  -0.0441   0.0831  -0.0224   0.0757   0.0204  -0.0191  -0.1859   0.0099  -0.1089  -0.0790  -0.0834   0.0339
    HRSTD_SQ |   0.1177   0.1595  -0.0534   0.9252   0.1315   0.0641   0.0645  -0.2746  -0.0178  -0.0414   0.3229  -0.0240  -0.1293  -0.0605  -0.1572   0.1910  -0.0245   0.1925
INTERNATIO~L |   0.1434   0.1436   0.0053   0.2103  -0.0541   0.2190   0.0263  -0.2798  -0.1131   0.0061   0.0212  -0.3300  -0.2287  -0.0523  -0.2260   0.0384  -0.0643   0.1745
    NONWHITE |  -0.0425  -0.0624  -0.0500   0.0903   0.0510   0.0460  -0.2412  -0.1652  -0.0016  -0.0667   0.1468   0.0335  -0.1144  -0.0336   0.0087   0.0982   0.0869  -0.0076
       WHITE |  -0.0999  -0.0852   0.0326  -0.2611   0.0114  -0.2359   0.1570   0.3814   0.1052   0.0445  -0.1297   0.2782   0.2961   0.0733   0.2013  -0.1090  -0.0061  -0.1547
 GREEK_DRINK |  -0.1609  -0.0548  -0.0830  -0.0320   0.0822  -0.0733   0.1133   0.1770   0.0023  -0.0900  -0.0616   0.7534   0.6234   0.0659   0.0927   0.0413   0.1498   0.1059
DECISION_S~R |  -0.0878  -0.1166   0.0233  -0.0528   0.1595   0.0530   0.0234  -0.0201  -0.0444   0.2837   0.0169   0.0846  -0.0420   0.0291   0.1865   0.0374   0.8703  -0.0406
INTERNATIO~E |   0.2048   0.1536   0.0946   0.1713   0.0375   0.5728  -0.0423  -0.2106  -0.0624   0.0419   0.1600  -0.2005  -0.2115  -0.0561  -0.1573   0.0812  -0.0273   0.1632
      FEMALE |   0.1453  -0.0003   0.0807   0.2374  -0.0874   0.1162  -0.0485  -0.0885  -0.0580  -0.0171   0.1379   0.0086  -0.1810  -0.0166  -0.1600  -0.0356  -0.0794   0.1713
 _est_Model1 |        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .
      resids |   0.7842  -0.0589   0.0763  -0.0121   0.0293  -0.0907  -0.0044   0.0207  -0.0649   0.0083  -0.1394  -0.0528  -0.0552  -0.1896   0.0524   0.0052   0.0352   0.0091
      fitted |   0.5977   0.7378   0.5131   0.3429   0.0427   0.2887  -0.1236  -0.0342  -0.0362   0.2327   0.2052  -0.0404  -0.1941   0.0314  -0.1744   0.1470  -0.2809   0.2620
    LN_HRSTD |   0.3087   0.2752   0.0593   0.8944   0.1039   0.0775   0.0551  -0.2295  -0.0053  -0.0067   0.2912  -0.0261  -0.1465  -0.0450  -0.1795   0.1557  -0.0549   0.2761
  LNHRSTD_SQ |   0.2723   0.2769   0.0222   0.9586   0.1172   0.0954   0.0650  -0.2694  -0.0049  -0.0173   0.3217  -0.0334  -0.1625  -0.0519  -0.1907   0.1909  -0.0422   0.2794
    LN_SLEEP |  -0.0749   0.0660  -0.0311   0.0550   0.0017  -0.0636   0.9397   0.0953  -0.0290   0.0408  -0.2331   0.0559   0.0913  -0.0211  -0.0126   0.0050   0.0387  -0.0954
     LN_HELP |   0.1372   0.1586  -0.1135   0.3083   0.1220   0.1120   0.0046  -0.0880   0.0005  -0.0666   0.3193   0.1095   0.1227  -0.0368  -0.0369   0.0829  -0.0487   0.8845
      LN_SAT |   0.3041   0.9001   0.1735   0.1797   0.0927   0.1433   0.1390   0.0482  -0.0120   0.0116  -0.0357   0.0037  -0.0899   0.0311  -0.0488   0.0266  -0.0742   0.1416
HSGPA_SCHO~R |   0.2620   0.1039   0.4737  -0.0489   0.0293   0.0515  -0.0407   0.1059  -0.0256   0.9177  -0.0185  -0.0826  -0.0932  -0.0112   0.1428  -0.1663  -0.0740  -0.0599
   SAT_GREEK |  -0.0346   0.0421   0.0152  -0.0078   0.0404   0.0232   0.0840   0.1634   0.0097  -0.1009   0.0218   0.9910   0.3245   0.1236   0.0884   0.0405   0.1318   0.1333
  LN_HREXTRA |   0.0799   0.0525   0.0937   0.0978   0.8915   0.1091  -0.0604   0.0473   0.0021  -0.0029   0.2480   0.0615   0.0800  -0.0181   0.2882   0.0878   0.1566   0.1215
_est_Model_1 |        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .
_est_Model_2 |        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .
    SLEEP_SQ |  -0.0752   0.0154  -0.0877   0.0941  -0.0553  -0.0908   0.9612  -0.0320   0.0257  -0.0522  -0.0916   0.1247   0.1610   0.0332   0.0251   0.1085   0.0537   0.0193

             | SAT_HS~A HRSTD_SQ INTERN~L NONWHITE    WHITE GREEK_~K DECISI~R INTERN~E   FEMALE _est_~l1   resids   fitted LN_HRSTD LNHRST~Q LN_SLEEP  LN_HELP   LN_SAT HSGPA_~R
-------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------
   SAT_HSGPA |   1.0000
    HRSTD_SQ |   0.0415   1.0000
INTERNATIO~L |   0.0972   0.1710   1.0000
    NONWHITE |  -0.0713   0.1044  -0.2964   1.0000
       WHITE |  -0.0358  -0.2356  -0.6968  -0.4785   1.0000
 GREEK_DRINK |  -0.0906  -0.0289  -0.2783  -0.0428   0.2880   1.0000
DECISION_S~R |  -0.0460  -0.0503  -0.0591   0.0904  -0.0135   0.0842   1.0000
INTERNATIO~E |   0.1635   0.1216   0.6596  -0.1955  -0.4596  -0.1689  -0.0103   1.0000
      FEMALE |   0.0471   0.2088   0.0500   0.0015  -0.0471  -0.0777  -0.0501   0.0463   1.0000
 _est_Model1 |        .        .        .        .        .        .        .        .        .        .
      resids |   0.0198  -0.0134   0.0307  -0.0085  -0.0218  -0.0899   0.0241  -0.0390  -0.0650        .   1.0000
      fitted |   0.7393   0.2069   0.1913  -0.0575  -0.1327  -0.1430  -0.1725   0.3804   0.3180        .  -0.0287   1.0000
    LN_HRSTD |   0.1772   0.6960   0.2087   0.0320  -0.2159  -0.0292  -0.0640   0.1702   0.2280        .   0.0543   0.4271   1.0000
  LNHRSTD_SQ |   0.1524   0.7908   0.2240   0.0549  -0.2472  -0.0345  -0.0583   0.1874   0.2357        .   0.0196   0.4133   0.9800   1.0000
    LN_SLEEP |   0.0024   0.0588   0.0225  -0.2408   0.1602   0.0751   0.0327  -0.0540  -0.0765        .  -0.0079  -0.1105   0.0177   0.0325   1.0000
     LN_HELP |  -0.0023   0.2339   0.1124   0.0627  -0.1504   0.1425  -0.0490   0.1050   0.1951        .   0.0044   0.2154   0.3323   0.3310  -0.0570   1.0000
      LN_SAT |   0.5969   0.1223   0.1158  -0.0350  -0.0802  -0.0226  -0.0593   0.1140  -0.0317        .  -0.0936   0.6109   0.1996   0.2032   0.1936   0.1484   1.0000
HSGPA_SCHO~R |   0.3919  -0.0638   0.0103  -0.0812   0.0515  -0.1214   0.2585   0.0655   0.0160        .   0.0305   0.3828   0.0038  -0.0186   0.0182  -0.1108   0.0658   1.0000
   SAT_GREEK |   0.0279  -0.0079  -0.3186   0.0356   0.2662   0.7379   0.0632  -0.1891   0.0139        .  -0.0535   0.0135  -0.0035  -0.0107   0.0387   0.1222   0.0498  -0.0917
  LN_HREXTRA |   0.0952   0.1024  -0.0999   0.0719   0.0378   0.0912   0.1415   0.0097  -0.0504        .   0.0641   0.0459   0.0618   0.0775  -0.0308   0.0983   0.0618   0.0277
_est_Model_1 |        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .
_est_Model_2 |        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .        .
    SLEEP_SQ |  -0.0660   0.0680   0.0337  -0.2167   0.1318   0.1329   0.0157  -0.0214  -0.0231        .  -0.0055  -0.1141   0.0835   0.0898   0.8111   0.0562   0.0971  -0.0868

             | SAT_GR~K LN_HRE~A _est_~_1 _est_M~2 SLEEP_SQ
-------------+---------------------------------------------
   SAT_GREEK |   1.0000
  LN_HREXTRA |   0.0676   1.0000
_est_Model_1 |        .        .        .
_est_Model_2 |        .        .        .        .
    SLEEP_SQ |   0.1144  -0.0768        .        .   1.0000


. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.32
       Model |  20.7034468        17  1.21784981   Prob > F        =    0.0000
    Residual |  36.7667177       372  .098835263   R-squared       =    0.3602
-------------+----------------------------------   Adj R-squared   =    0.3310
       Total |  57.4701645       389  .147738212   Root MSE        =    .31438

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024771   .0006254     3.96   0.000     .0012472    .0037069
               HSGPA |   .8147075   .2476574     3.29   0.001     .3277235    1.301691
           SAT_HSGPA |  -.0004842   .0001769    -2.74   0.006     -.000832   -.0001365
            LN_HRSTD |   .0589425     .02268     2.60   0.010     .0143454    .1035395
             HREXTRA |  -.0006791   .0020256    -0.34   0.738    -.0046621     .003304
              DOUBLE |  -.0072618   .0452355    -0.16   0.873    -.0962111    .0816876
              FEMALE |   .0998471   .0346912     2.88   0.004     .0316316    .1680626
               SLEEP |  -.0027603    .001513    -1.82   0.069    -.0057355    .0002148
       INTERNATIONAL |  -.0531392   .0487946    -1.09   0.277     -.149087    .0428086
INTERNATIONAL_DOUBLE |   .1996083   .0749434     2.66   0.008     .0522424    .3469742
             SCHOLAR |   .1156214   .0554548     2.08   0.038     .0065772    .2246655
               GREEK |    .067521   .0517754     1.30   0.193    -.0342882    .1693301
               DRINK |   .0057087   .0030026     1.90   0.058    -.0001955     .011613
         GREEK_DRINK |  -.0074602   .0041067    -1.82   0.070    -.0155355     .000615
             ATHLETE |  -.0285548   .0392778    -0.73   0.468    -.1057891    .0486796
              FRIEND |   .0012743   .0005544     2.30   0.022     .0001842    .0023645
            DECISION |  -.0607339   .0339088    -1.79   0.074    -.1274108    .0059429
               _cons |  -.7042542   .8525596    -0.83   0.409    -2.380695    .9721862
--------------------------------------------------------------------------------------

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(16, 373)      =     13.12
       Model |  20.6923393        16   1.2932712   Prob > F        =    0.0000
    Residual |  36.7778252       373  .098600068   R-squared       =    0.3601
-------------+----------------------------------   Adj R-squared   =    0.3326
       Total |  57.4701645       389  .147738212   Root MSE        =    .31401

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024879   .0006239     3.99   0.000     .0012611    .0037146
               HSGPA |   .8176489   .2472073     3.31   0.001     .3315542    1.303744
           SAT_HSGPA |  -.0004874   .0001764    -2.76   0.006    -.0008343   -.0001405
            LN_HRSTD |   .0575611    .022276     2.58   0.010     .0137589    .1013633
              DOUBLE |  -.0083904   .0450564    -0.19   0.852    -.0969867     .080206
              FEMALE |     .10077   .0345407     2.92   0.004     .0328511    .1686888
               SLEEP |  -.0027429   .0015103    -1.82   0.070    -.0057127    .0002269
       INTERNATIONAL |  -.0528414   .0487284    -1.08   0.279    -.1486582    .0429755
INTERNATIONAL_DOUBLE |   .1994623    .074853     2.66   0.008     .0522756     .346649
             SCHOLAR |   .1174059    .055133     2.13   0.034     .0089955    .2258163
               GREEK |   .0686864   .0515971     1.33   0.184    -.0327711     .170144
               DRINK |   .0057365   .0029979     1.91   0.056    -.0001584    .0116314
         GREEK_DRINK |  -.0075456   .0040939    -1.84   0.066    -.0155956    .0005044
             ATHLETE |   -.034034   .0356731    -0.95   0.341    -.1041795    .0361115
              FRIEND |   .0012766   .0005537     2.31   0.022     .0001878    .0023654
            DECISION |  -.0623067   .0335426    -1.86   0.064    -.1282631    .0036497
               _cons |  -.7199853   .8502538    -0.85   0.398    -2.391877    .9519065
--------------------------------------------------------------------------------------

. summarize ATHLETE if ATHLETE == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     ATHLETE |        162           1           0          1          1

. corr DOUBLE HRSTD
(obs=406)

             |   DOUBLE    HRSTD
-------------+------------------
      DOUBLE |   1.0000
       HRSTD |   0.1458   1.0000


. gen DOUBLE_HRSTD = DOUBLE*HRSTD
(4 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATH
> LETE FRIEND DECISION HELP DOUBLE_HRSTD

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     11.17
       Model |  20.9467099        19  1.10245842   Prob > F        =    0.0000
    Residual |  36.5234546       370  .098712039   R-squared       =    0.3645
-------------+----------------------------------   Adj R-squared   =    0.3318
       Total |  57.4701645       389  .147738212   Root MSE        =    .31418

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |    .002488   .0006272     3.97   0.000     .0012547    .0037213
               HSGPA |   .8185796   .2478803     3.30   0.001     .3311487    1.306011
           SAT_HSGPA |  -.0004894   .0001772    -2.76   0.006    -.0008379   -.0001409
            LN_HRSTD |   .0763927     .02672     2.86   0.004     .0238506    .1289348
             HREXTRA |  -.0006409   .0020417    -0.31   0.754    -.0046557    .0033739
              DOUBLE |   .0520615   .0597151     0.87   0.384    -.0653621    .1694851
              FEMALE |   .1015185    .034956     2.90   0.004     .0327812    .1702559
               SLEEP |  -.0027994   .0015205    -1.84   0.066    -.0057892    .0001904
       INTERNATIONAL |  -.0576484   .0488943    -1.18   0.239    -.1537941    .0384972
INTERNATIONAL_DOUBLE |   .2252667     .07715     2.92   0.004     .0735592    .3769741
             SCHOLAR |   .1218028   .0555948     2.19   0.029     .0124814    .2311242
               GREEK |   .0632189     .05228     1.21   0.227    -.0395844    .1660222
               DRINK |   .0059197   .0030399     1.95   0.052    -.0000579    .0118973
         GREEK_DRINK |  -.0071327   .0041269    -1.73   0.085    -.0152478    .0009824
             ATHLETE |  -.0291737   .0393189    -0.74   0.459    -.1064903     .048143
              FRIEND |   .0012533   .0005543     2.26   0.024     .0001634    .0023432
            DECISION |  -.0548871   .0340954    -1.61   0.108    -.1219321     .012158
                HELP |   .0017984   .0055468     0.32   0.746    -.0091088    .0127056
        DOUBLE_HRSTD |  -.0030137   .0019627    -1.54   0.126    -.0068732    .0008457
               _cons |  -.7658091   .8555457    -0.90   0.371    -2.448151    .9165327
--------------------------------------------------------------------------------------

. gen GREEK_HRSTD = GREEK*HRSTD

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND D
> ECISION HELP GREEK_HRSTD

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(19, 370)      =     11.12
       Model |  20.8947955        19  1.09972608   Prob > F        =    0.0000
    Residual |   36.575369       370  .098852349   R-squared       =    0.3636
-------------+----------------------------------   Adj R-squared   =    0.3309
       Total |  57.4701645       389  .147738212   Root MSE        =    .31441

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024854   .0006276     3.96   0.000     .0012512    .0037196
               HSGPA |   .8171971   .2480499     3.29   0.001     .3294327    1.304961
           SAT_HSGPA |  -.0004861   .0001773    -2.74   0.006    -.0008348   -.0001374
            LN_HRSTD |   .0730567   .0263873     2.77   0.006     .0211688    .1249446
             HREXTRA |  -.0005422   .0020481    -0.26   0.791    -.0045695    .0034851
              DOUBLE |  -.0041128   .0453507    -0.09   0.928    -.0932902    .0850646
              FEMALE |   .0941113   .0350795     2.68   0.008     .0251311    .1630916
               SLEEP |  -.0027962   .0015217    -1.84   0.067    -.0057886    .0001961
       INTERNATIONAL |  -.0555666   .0488851    -1.14   0.256    -.1516941    .0405609
INTERNATIONAL_DOUBLE |   .1909399   .0753016     2.54   0.012     .0428671    .3390127
             SCHOLAR |   .1171558   .0555295     2.11   0.036     .0079628    .2263489
               GREEK |   .1285032   .0702289     1.83   0.068    -.0095946     .266601
               DRINK |   .0060802   .0030569     1.99   0.047     .0000691    .0120913
         GREEK_DRINK |  -.0081515   .0041729    -1.95   0.052     -.016357    .0000541
             ATHLETE |  -.0319313   .0394523    -0.81   0.419    -.1095101    .0456475
              FRIEND |   .0013704   .0005594     2.45   0.015     .0002703    .0024704
            DECISION |  -.0574462   .0339951    -1.69   0.092     -.124294    .0094016
                HELP |   .0023553   .0055653     0.42   0.672    -.0085884    .0132989
         GREEK_HRSTD |  -.0028695   .0021216    -1.35   0.177    -.0070413    .0013024
               _cons |  -.7630335   .8564722    -0.89   0.374    -2.447197    .9211302
--------------------------------------------------------------------------------------

. drop LN_HELP

. gen LN_HELP = (LN_HELP+1)
LN_HELP not found
r(111);

.  gen LN_HELP = (HELP+1)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION LN_HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
             LN_HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6873802   .8551551    -0.80   0.422    -2.368939    .9941786
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND LN_HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.57
       Model |  20.6619288        18  1.14788493   Prob > F        =    0.0000
    Residual |  36.8082357       371  .099213573   R-squared       =    0.3595
-------------+----------------------------------   Adj R-squared   =    0.3285
       Total |  57.4701645       389  .147738212   Root MSE        =    .31498

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025258   .0006273     4.03   0.000     .0012922    .0037593
               HSGPA |   .8145708   .2483958     3.28   0.001     .3261305    1.303011
           SAT_HSGPA |  -.0004862   .0001775    -2.74   0.006    -.0008352   -.0001371
            LN_HRSTD |    .210202   .0951207     2.21   0.028     .0231588    .3972453
          LNHRSTD_SQ |  -.0293802   .0180094    -1.63   0.104    -.0647935     .006033
             HREXTRA |  -.0011772   .0020264    -0.58   0.562    -.0051619    .0028076
              DOUBLE |  -.0104637   .0453351    -0.23   0.818    -.0996097    .0786823
              FEMALE |   .1056122   .0350251     3.02   0.003     .0367396    .1744847
               SLEEP |  -.0025372   .0015261    -1.66   0.097     -.005538    .0004637
       INTERNATIONAL |  -.0565473   .0489658    -1.15   0.249    -.1528327    .0397381
INTERNATIONAL_DOUBLE |   .2062327   .0753721     2.74   0.007     .0580226    .3544428
             SCHOLAR |   .1207352   .0555588     2.17   0.030     .0114855    .2299848
               GREEK |   .0571357   .0525592     1.09   0.278    -.0462155     .160487
               DRINK |   .0060499   .0030231     2.00   0.046     .0001055    .0119944
         GREEK_DRINK |  -.0073396   .0041362    -1.77   0.077    -.0154729    .0007938
             ATHLETE |  -.0384244   .0393509    -0.98   0.329    -.1158032    .0389543
              FRIEND |   .0013642   .0005624     2.43   0.016     .0002582    .0024701
             LN_HELP |   .0022495    .005565     0.40   0.686    -.0086933    .0131924
               _cons |  -.9750936   .8575665    -1.14   0.256    -2.661394    .7112069
--------------------------------------------------------------------------------------

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK 

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(13, 376)      =     14.95
       Model |  19.5792043        13  1.50609264   Prob > F        =    0.0000
    Residual |  37.8909602       376   .10077383   R-squared       =    0.3407
-------------+----------------------------------   Adj R-squared   =    0.3179
       Total |  57.4701645       389  .147738212   Root MSE        =    .31745

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0023436   .0006224     3.77   0.000     .0011197    .0035675
               HSGPA |   .7259889    .246469     2.95   0.003     .2413587    1.210619
           SAT_HSGPA |  -.0004302   .0001763    -2.44   0.015    -.0007769   -.0000834
            LN_HRSTD |   .1810299   .0945565     1.91   0.056    -.0048959    .3669558
          LNHRSTD_SQ |   -.022393    .017808    -1.26   0.209    -.0574087    .0126228
             HREXTRA |   -.001745   .0018222    -0.96   0.339     -.005328    .0018381
              DOUBLE |  -.0184428   .0448367    -0.41   0.681    -.1066049    .0697194
              FEMALE |   .1032496   .0348525     2.96   0.003     .0347194    .1717799
               SLEEP |  -.0021272   .0015137    -1.41   0.161    -.0051037    .0008492
       INTERNATIONAL |  -.0608049   .0488791    -1.24   0.214    -.1569156    .0353058
INTERNATIONAL_DOUBLE |   .2127833   .0748698     2.84   0.005     .0655673    .3599993
             SCHOLAR |    .102635   .0546516     1.88   0.061    -.0048261    .2100961
               GREEK |   .0072223   .0364143     0.20   0.843    -.0643789    .0788235
               _cons |  -.5851741   .8462963    -0.69   0.490    -2.249241    1.078893
--------------------------------------------------------------------------------------

. > DRINK GREEK_DRINK ATHLETE FRIEND HELP
> is not a valid command name
r(199);

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LNHRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.57
       Model |  20.6619288        18  1.14788493   Prob > F        =    0.0000
    Residual |  36.8082357       371  .099213573   R-squared       =    0.3595
-------------+----------------------------------   Adj R-squared   =    0.3285
       Total |  57.4701645       389  .147738212   Root MSE        =    .31498

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025258   .0006273     4.03   0.000     .0012922    .0037593
               HSGPA |   .8145708   .2483958     3.28   0.001     .3261305    1.303011
           SAT_HSGPA |  -.0004862   .0001775    -2.74   0.006    -.0008352   -.0001371
            LN_HRSTD |    .210202   .0951207     2.21   0.028     .0231588    .3972453
          LNHRSTD_SQ |  -.0293802   .0180094    -1.63   0.104    -.0647935     .006033
             HREXTRA |  -.0011772   .0020264    -0.58   0.562    -.0051619    .0028076
              DOUBLE |  -.0104637   .0453351    -0.23   0.818    -.0996097    .0786823
              FEMALE |   .1056122   .0350251     3.02   0.003     .0367396    .1744847
               SLEEP |  -.0025372   .0015261    -1.66   0.097     -.005538    .0004637
       INTERNATIONAL |  -.0565473   .0489658    -1.15   0.249    -.1528327    .0397381
INTERNATIONAL_DOUBLE |   .2062327   .0753721     2.74   0.007     .0580226    .3544428
             SCHOLAR |   .1207352   .0555588     2.17   0.030     .0114855    .2299848
               GREEK |   .0571357   .0525592     1.09   0.278    -.0462155     .160487
               DRINK |   .0060499   .0030231     2.00   0.046     .0001055    .0119944
         GREEK_DRINK |  -.0073396   .0041362    -1.77   0.077    -.0154729    .0007938
             ATHLETE |  -.0384244   .0393509    -0.98   0.329    -.1158032    .0389543
              FRIEND |   .0013642   .0005624     2.43   0.016     .0002582    .0024701
                HELP |   .0022495    .005565     0.40   0.686    -.0086933    .0131924
               _cons |  -.9728441   .8579007    -1.13   0.258    -2.659802    .7141136
--------------------------------------------------------------------------------------

. 
.  
. .  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK FRIEND LN_HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(16, 373)      =     12.64
       Model |  20.2038553        16  1.26274096   Prob > F        =    0.0000
    Residual |  37.2663092       373  .099909676   R-squared       =    0.3516
-------------+----------------------------------   Adj R-squared   =    0.3237
       Total |  57.4701645       389  .147738212   Root MSE        =    .31608

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025781   .0006284     4.10   0.000     .0013424    .0038138
               HSGPA |   .8409436   .2488383     3.38   0.001     .3516419    1.330245
           SAT_HSGPA |   -.000502   .0001778    -2.82   0.005    -.0008515   -.0001524
            LN_HRSTD |   .0603236    .023327     2.59   0.010     .0144548    .1061925
          LN_HREXTRA |   .0041369   .0204002     0.20   0.839     -.035977    .0442508
              DOUBLE |  -.0143574    .045554    -0.32   0.753    -.1039323    .0752175
              FEMALE |   .1091822   .0348274     3.13   0.002     .0406996    .1776649
               SLEEP |  -.0026636   .0015297    -1.74   0.082    -.0056715    .0003442
       INTERNATIONAL |  -.0489014    .049101    -1.00   0.320    -.1454509    .0476481
INTERNATIONAL_DOUBLE |    .202606   .0754872     2.68   0.008     .0541721    .3510399
             SCHOLAR |   .1137721   .0547772     2.08   0.038     .0060612    .2214829
               GREEK |   .0597614    .052116     1.15   0.252    -.0427165    .1622394
               DRINK |   .0057035   .0030007     1.90   0.058    -.0001968    .0116038
         GREEK_DRINK |  -.0072934    .004096    -1.78   0.076    -.0153476    .0007608
              FRIEND |   .0011389   .0005552     2.05   0.041     .0000471    .0022307
             LN_HELP |   .0013538   .0055623     0.24   0.808    -.0095836    .0122913
               _cons |  -.9130483    .855798    -1.07   0.287    -2.595842    .7697453
--------------------------------------------------------------------------------------

. 
. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.67
       Model |  20.7790378        18  1.15439099   Prob > F        =    0.0000
    Residual |  36.6911267       371  .098897916   R-squared       =    0.3616
-------------+----------------------------------   Adj R-squared   =    0.3306
       Total |  57.4701645       389  .147738212   Root MSE        =    .31448

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024931   .0006267     3.98   0.000     .0012608    .0037254
               HSGPA |   .8176067   .2478714     3.30   0.001     .3301977    1.305016
           SAT_HSGPA |  -.0004889   .0001771    -2.76   0.006    -.0008371   -.0001408
            LN_HRSTD |   .0535905    .023416     2.29   0.023     .0075458    .0996351
          LN_HREXTRA |   .0194633   .0217994     0.89   0.373    -.0234026    .0623292
              DOUBLE |  -.0124916   .0453428    -0.28   0.783    -.1016527    .0766694
              FEMALE |   .1011901   .0348227     2.91   0.004     .0327154    .1696648
               SLEEP |  -.0026325   .0015223    -1.73   0.085    -.0056259    .0003609
       INTERNATIONAL |  -.0513892    .048928    -1.05   0.294    -.1476001    .0448217
INTERNATIONAL_DOUBLE |   .1977731   .0751409     2.63   0.009     .0500176    .3455285
             SCHOLAR |   .1209419   .0553955     2.18   0.030     .0120134    .2298704
               GREEK |   .0684874   .0521685     1.31   0.190    -.0340957    .1710704
               DRINK |   .0056458   .0030312     1.86   0.063    -.0003148    .0116063
         GREEK_DRINK |  -.0075726   .0041204    -1.84   0.067    -.0156748    .0005296
             ATHLETE |  -.0453624   .0379193    -1.20   0.232    -.1199261    .0292013
              FRIEND |   .0012586   .0005549     2.27   0.024     .0001675    .0023497
            DECISION |  -.0655364   .0337787    -1.94   0.053    -.1319581    .0008853
                HELP |   .0010495   .0055377     0.19   0.850    -.0098397    .0119388
               _cons |  -.7602591    .855257    -0.89   0.375    -2.442018       .9215
--------------------------------------------------------------------------------------

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.39
       Model |  20.7754855        17  1.22208738   Prob > F        =    0.0000
    Residual |   36.694679       372   .09864161   R-squared       =    0.3615
-------------+----------------------------------   Adj R-squared   =    0.3323
       Total |  57.4701645       389  .147738212   Root MSE        =    .31407

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025018   .0006242     4.01   0.000     .0012744    .0037292
               HSGPA |   .8198369   .2472708     3.32   0.001      .333613    1.306061
           SAT_HSGPA |   -.000491   .0001765    -2.78   0.006    -.0008381    -.000144
            LN_HRSTD |   .0548129   .0224808     2.44   0.015     .0106075    .0990184
          LN_HREXTRA |   .0198842   .0216579     0.92   0.359    -.0227031    .0624714
              DOUBLE |  -.0121833   .0452548    -0.27   0.788    -.1011706     .076804
              FEMALE |   .1019097   .0345702     2.95   0.003     .0339321    .1698873
               SLEEP |  -.0026601   .0015133    -1.76   0.080    -.0056359    .0003156
       INTERNATIONAL |  -.0508645   .0487862    -1.04   0.298    -.1467959    .0450669
INTERNATIONAL_DOUBLE |   .1987325   .0748729     2.65   0.008     .0515052    .3459598
             SCHOLAR |    .120359   .0552383     2.18   0.030     .0117405    .2289775
               GREEK |   .0698237   .0516228     1.35   0.177    -.0316854    .1713327
               DRINK |   .0057247   .0029986     1.91   0.057    -.0001716     .011621
         GREEK_DRINK |  -.0076471   .0040963    -1.87   0.063    -.0157019    .0004076
             ATHLETE |  -.0456188    .037846    -1.21   0.229    -.1200377    .0288002
              FRIEND |   .0012602   .0005541     2.27   0.024     .0001706    .0023497
            DECISION |   -.065547   .0337348    -1.94   0.053    -.1318819    .0007879
               _cons |  -.7710578   .8522503    -0.90   0.366     -2.44689    .9047745
--------------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |    143.95    0.006947
       HSGPA |     81.56    0.012261
         SAT |     36.05    0.027740
 GREEK_DRINK |      3.89    0.256938
INTERNATIO~E |      2.56    0.390441
       DRINK |      2.56    0.390878
       GREEK |      2.36    0.423885
INTERNATIO~L |      1.94    0.516383
      DOUBLE |      1.76    0.569498
     ATHLETE |      1.34    0.744234
    LN_HRSTD |      1.27    0.790424
  LN_HREXTRA |      1.21    0.828426
     SCHOLAR |      1.11    0.900567
      FEMALE |      1.10    0.906120
    DECISION |      1.10    0.906369
      FRIEND |      1.08    0.929857
       SLEEP |      1.07    0.932576
-------------+----------------------
    Mean VIF |     16.82

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   1.55
Prob > chi2 = 0.2130

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GRE
> EK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. ovtest

Ramsey RESET test for omitted variables
Omitted: Powers of fitted values of COLLGPA

H0: Model has no omitted variables

F(3, 368) =   7.59
 Prob > F = 0.0001

. gen LN_HSGPA = ln(HSGPA)
(1 missing value generated)

. 
. reg COLLGPA SAT LN_HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK 
> GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     12.33
       Model |  23.0700838        20  1.15350419   Prob > F        =    0.0000
    Residual |  34.7206326       371  .093586611   R-squared       =    0.3992
-------------+----------------------------------   Adj R-squared   =    0.3668
       Total |  57.7907164       391  .147802344   Root MSE        =    .30592

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0015618   .0002309     6.76   0.000     .0011077    .0020158
            LN_HSGPA |   2.241837   .3671008     6.11   0.000     1.519978    2.963696
           SAT_HSGPA |  -.0002457   .0000596    -4.12   0.000     -.000363   -.0001284
               HRSTD |    .003432   .0026403     1.30   0.194    -.0017598    .0086238
            HRSTD_SQ |  -.0000317   .0000323    -0.98   0.327    -.0000953    .0000319
             HREXTRA |  -.0000702   .0019881    -0.04   0.972    -.0039795    .0038392
              DOUBLE |  -.0026746   .0440386    -0.06   0.952    -.0892712    .0839221
              FEMALE |   .0939597   .0340989     2.76   0.006     .0269084    .1610109
               SLEEP |  -.0027395    .001468    -1.87   0.063    -.0056262    .0001471
       INTERNATIONAL |  -.0270115   .0476832    -0.57   0.571    -.1207747    .0667517
INTERNATIONAL_DOUBLE |   .1868345     .07316     2.55   0.011     .0429742    .3306949
             SCHOLAR |   .1353754   .0753181     1.80   0.073    -.0127286    .2834793
               GREEK |   .0619088    .051009     1.21   0.226    -.0383942    .1622118
               DRINK |   .0060129    .002981     2.02   0.044      .000151    .0118747
         GREEK_DRINK |   -.007449   .0040334    -1.85   0.066    -.0153802    .0004822
             ATHLETE |  -.0313645   .0384136    -0.82   0.415    -.1069002    .0441712
              FRIEND |   .0013203   .0005403     2.44   0.015      .000258    .0023827
            DECISION |  -.0075748   .0999466    -0.08   0.940    -.2041077    .1889582
    DECISION_SCHOLAR |   -.053409   .1054139    -0.51   0.613    -.2606927    .1538747
                HELP |   .0031843    .005413     0.59   0.557    -.0074597    .0138282
               _cons |  -.4878664   .4635559    -1.05   0.293    -1.399393    .4236601
--------------------------------------------------------------------------------------

. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |     17.38    0.057535
DECISION_S~R |     10.97    0.091182
    DECISION |     10.28    0.097311
    LN_HSGPA |     10.25    0.097514
       HRSTD |      7.94    0.125994
    HRSTD_SQ |      7.08    0.141273
         SAT |      5.22    0.191746
 GREEK_DRINK |      4.00    0.249897
       DRINK |      2.68    0.373724
INTERNATIO~E |      2.58    0.387677
       GREEK |      2.44    0.409312
     SCHOLAR |      2.18    0.459302
INTERNATIO~L |      1.95    0.511784
      DOUBLE |      1.76    0.569214
     ATHLETE |      1.47    0.681514
     HREXTRA |      1.36    0.735519
        HELP |      1.27    0.788962
      FEMALE |      1.14    0.880958
      FRIEND |      1.09    0.915610
       SLEEP |      1.07    0.932229
-------------+----------------------
    Mean VIF |      4.70

. reg COLLGPA SAT LN_HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK 
> GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     12.33
       Model |  23.0700838        20  1.15350419   Prob > F        =    0.0000
    Residual |  34.7206326       371  .093586611   R-squared       =    0.3992
-------------+----------------------------------   Adj R-squared   =    0.3668
       Total |  57.7907164       391  .147802344   Root MSE        =    .30592

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0015618   .0002309     6.76   0.000     .0011077    .0020158
            LN_HSGPA |   2.241837   .3671008     6.11   0.000     1.519978    2.963696
           SAT_HSGPA |  -.0002457   .0000596    -4.12   0.000     -.000363   -.0001284
               HRSTD |    .003432   .0026403     1.30   0.194    -.0017598    .0086238
            HRSTD_SQ |  -.0000317   .0000323    -0.98   0.327    -.0000953    .0000319
             HREXTRA |  -.0000702   .0019881    -0.04   0.972    -.0039795    .0038392
              DOUBLE |  -.0026746   .0440386    -0.06   0.952    -.0892712    .0839221
              FEMALE |   .0939597   .0340989     2.76   0.006     .0269084    .1610109
               SLEEP |  -.0027395    .001468    -1.87   0.063    -.0056262    .0001471
       INTERNATIONAL |  -.0270115   .0476832    -0.57   0.571    -.1207747    .0667517
INTERNATIONAL_DOUBLE |   .1868345     .07316     2.55   0.011     .0429742    .3306949
             SCHOLAR |   .1353754   .0753181     1.80   0.073    -.0127286    .2834793
               GREEK |   .0619088    .051009     1.21   0.226    -.0383942    .1622118
               DRINK |   .0060129    .002981     2.02   0.044      .000151    .0118747
         GREEK_DRINK |   -.007449   .0040334    -1.85   0.066    -.0153802    .0004822
             ATHLETE |  -.0313645   .0384136    -0.82   0.415    -.1069002    .0441712
              FRIEND |   .0013203   .0005403     2.44   0.015      .000258    .0023827
            DECISION |  -.0075748   .0999466    -0.08   0.940    -.2041077    .1889582
    DECISION_SCHOLAR |   -.053409   .1054139    -0.51   0.613    -.2606927    .1538747
                HELP |   .0031843    .005413     0.59   0.557    -.0074597    .0138282
               _cons |  -.4878664   .4635559    -1.05   0.293    -1.399393    .4236601
--------------------------------------------------------------------------------------

. 
.  reg COLLGPA SAT LN_HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     14.68
       Model |  23.0727843        17   1.3572226   Prob > F        =    0.0000
    Residual |  34.3973802       372  .092466076   R-squared       =    0.4015
-------------+----------------------------------   Adj R-squared   =    0.3741
       Total |  57.4701645       389  .147738212   Root MSE        =    .30408

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0015507   .0002276     6.81   0.000     .0011032    .0019983
            LN_HSGPA |    2.19964   .3637296     6.05   0.000     1.484416    2.914864
           SAT_HSGPA |  -.0002444   .0000589    -4.15   0.000    -.0003603   -.0001286
            LN_HRSTD |   .0442929   .0218488     2.03   0.043     .0013304    .0872554
          LN_HREXTRA |   .0238974   .0209824     1.14   0.255    -.0173617    .0651564
              DOUBLE |  -.0058117   .0438221    -0.13   0.895    -.0919818    .0803583
              FEMALE |    .095372   .0334255     2.85   0.005     .0296455    .1610985
               SLEEP |  -.0026103   .0014565    -1.79   0.074    -.0054744    .0002537
       INTERNATIONAL |  -.0271099   .0474669    -0.57   0.568    -.1204471    .0662273
INTERNATIONAL_DOUBLE |   .1916176   .0724278     2.65   0.008     .0491984    .3340368
             SCHOLAR |   .1109143   .0530598     2.09   0.037     .0065795    .2152491
               GREEK |   .0700121   .0499733     1.40   0.162    -.0282534    .1682776
               DRINK |   .0068924   .0029004     2.38   0.018     .0011892    .0125956
         GREEK_DRINK |  -.0081682   .0039583    -2.06   0.040    -.0159517   -.0003848
             ATHLETE |  -.0475169   .0366441    -1.30   0.196    -.1195724    .0245386
              FRIEND |   .0012303   .0005363     2.29   0.022     .0001757    .0022849
            DECISION |  -.0585313   .0326879    -1.79   0.074    -.1228075     .005745
               _cons |   -.531858   .4521524    -1.18   0.240    -1.420953    .3572371
--------------------------------------------------------------------------------------

. 
. 
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
   SAT_HSGPA |     17.11    0.058441
    LN_HSGPA |     10.14    0.098572
         SAT |      5.11    0.195565
 GREEK_DRINK |      3.88    0.257933
INTERNATIO~E |      2.56    0.391126
       DRINK |      2.55    0.391634
       GREEK |      2.36    0.424012
INTERNATIO~L |      1.96    0.511336
      DOUBLE |      1.76    0.569322
     ATHLETE |      1.34    0.744157
    LN_HRSTD |      1.27    0.784430
  LN_HREXTRA |      1.21    0.827364
    DECISION |      1.11    0.904920
      FEMALE |      1.10    0.908570
     SCHOLAR |      1.09    0.914928
      FRIEND |      1.07    0.930422
       SLEEP |      1.06    0.943742
-------------+----------------------
    Mean VIF |      3.33

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   6.25
Prob > chi2 = 0.0125

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.39
       Model |  20.7754855        17  1.22208738   Prob > F        =    0.0000
    Residual |   36.694679       372   .09864161   R-squared       =    0.3615
-------------+----------------------------------   Adj R-squared   =    0.3323
       Total |  57.4701645       389  .147738212   Root MSE        =    .31407

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025018   .0006242     4.01   0.000     .0012744    .0037292
               HSGPA |   .8198369   .2472708     3.32   0.001      .333613    1.306061
           SAT_HSGPA |   -.000491   .0001765    -2.78   0.006    -.0008381    -.000144
            LN_HRSTD |   .0548129   .0224808     2.44   0.015     .0106075    .0990184
          LN_HREXTRA |   .0198842   .0216579     0.92   0.359    -.0227031    .0624714
              DOUBLE |  -.0121833   .0452548    -0.27   0.788    -.1011706     .076804
              FEMALE |   .1019097   .0345702     2.95   0.003     .0339321    .1698873
               SLEEP |  -.0026601   .0015133    -1.76   0.080    -.0056359    .0003156
       INTERNATIONAL |  -.0508645   .0487862    -1.04   0.298    -.1467959    .0450669
INTERNATIONAL_DOUBLE |   .1987325   .0748729     2.65   0.008     .0515052    .3459598
             SCHOLAR |    .120359   .0552383     2.18   0.030     .0117405    .2289775
               GREEK |   .0698237   .0516228     1.35   0.177    -.0316854    .1713327
               DRINK |   .0057247   .0029986     1.91   0.057    -.0001716     .011621
         GREEK_DRINK |  -.0076471   .0040963    -1.87   0.063    -.0157019    .0004076
             ATHLETE |  -.0456188    .037846    -1.21   0.229    -.1200377    .0288002
              FRIEND |   .0012602   .0005541     2.27   0.024     .0001706    .0023497
            DECISION |   -.065547   .0337348    -1.94   0.053    -.1318819    .0007879
               _cons |  -.7710578   .8522503    -0.90   0.366     -2.44689    .9047745
--------------------------------------------------------------------------------------

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   1.55
Prob > chi2 = 0.2130

.  reg COLLGPA SAT HSGPA SAT_LNHSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION
variable SAT_LNHSGPA not found
r(111);

. gen SAT_LNHSGPA = SAT*LN_HSGPA
(12 missing values generated)

.  reg COLLGPA SAT HSGPA SAT_LNHSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND D
> ECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     14.45
       Model |  22.8569704        17  1.34452767   Prob > F        =    0.0000
    Residual |  34.6131941       372  .093046221   R-squared       =    0.3977
-------------+----------------------------------   Adj R-squared   =    0.3702
       Total |  57.4701645       389  .147738212   Root MSE        =    .30503

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |  -.0021701   .0005479    -3.96   0.000    -.0032475   -.0010926
               HSGPA |  -.5477494   .1270381    -4.31   0.000    -.7975522   -.2979466
         SAT_LNHSGPA |   .0022902   .0004142     5.53   0.000     .0014758    .0031046
            LN_HRSTD |   .0497474   .0218044     2.28   0.023      .006872    .0926228
          LN_HREXTRA |   .0240318   .0210529     1.14   0.254    -.0173657    .0654294
              DOUBLE |  -.0123358   .0439224    -0.28   0.779    -.0987031    .0740316
              FEMALE |   .1068507   .0333984     3.20   0.001     .0411773    .1725241
               SLEEP |  -.0017738   .0014582    -1.22   0.225    -.0046412    .0010937
       INTERNATIONAL |  -.0366064   .0474364    -0.77   0.441    -.1298836    .0566707
INTERNATIONAL_DOUBLE |   .1779703   .0726702     2.45   0.015     .0350743    .3208662
             SCHOLAR |   .1539813   .0528622     2.91   0.004     .0500352    .2579274
               GREEK |   .0629412    .050127     1.26   0.210    -.0356265     .161509
               DRINK |   .0050416   .0028788     1.75   0.081    -.0006191    .0107023
         GREEK_DRINK |  -.0062872    .003959    -1.59   0.113     -.014072    .0014977
             ATHLETE |  -.0475745   .0367588    -1.29   0.196    -.1198556    .0247067
              FRIEND |   .0011922   .0005382     2.22   0.027     .0001339    .0022505
            DECISION |  -.0603878   .0327747    -1.84   0.066    -.1248348    .0040592
               _cons |    4.04086   .4880349     8.28   0.000     3.081207    5.000513
--------------------------------------------------------------------------------------

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
 SAT_LNHSGPA |     64.82    0.015427
         SAT |     29.45    0.033957
       HSGPA |     22.82    0.043817
 GREEK_DRINK |      3.85    0.259456
INTERNATIO~E |      2.56    0.390958
       DRINK |      2.50    0.400025
       GREEK |      2.36    0.424060
INTERNATIO~L |      1.94    0.515206
      DOUBLE |      1.75    0.570279
     ATHLETE |      1.34    0.744158
    LN_HRSTD |      1.26    0.792562
  LN_HREXTRA |      1.21    0.826994
    DECISION |      1.10    0.905780
      FEMALE |      1.09    0.915751
     SCHOLAR |      1.08    0.927567
      FRIEND |      1.08    0.929714
       SLEEP |      1.06    0.947420
-------------+----------------------
    Mean VIF |      8.31

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   9.94
Prob > chi2 = 0.0016

. corr SAT COLLGPA
(obs=399)

             |      SAT  COLLGPA
-------------+------------------
         SAT |   1.0000
     COLLGPA |   0.4477   1.0000


. testparm SAT COLLGPA, r(rho) onesided
option r() not allowed
r(198);

. 
. scalar n = _N

. scalar r = r(rho)

. scalar t_stat = r * sqrt((n - 2) / (1 - r^2))

. display t_stat
8.0559575

. 
. scalar p_value = ttail(n - 2, t_stat)

. display p_value
4.387e-15

. 
. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.39
       Model |  20.7754855        17  1.22208738   Prob > F        =    0.0000
    Residual |   36.694679       372   .09864161   R-squared       =    0.3615
-------------+----------------------------------   Adj R-squared   =    0.3323
       Total |  57.4701645       389  .147738212   Root MSE        =    .31407

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025018   .0006242     4.01   0.000     .0012744    .0037292
               HSGPA |   .8198369   .2472708     3.32   0.001      .333613    1.306061
           SAT_HSGPA |   -.000491   .0001765    -2.78   0.006    -.0008381    -.000144
            LN_HRSTD |   .0548129   .0224808     2.44   0.015     .0106075    .0990184
          LN_HREXTRA |   .0198842   .0216579     0.92   0.359    -.0227031    .0624714
              DOUBLE |  -.0121833   .0452548    -0.27   0.788    -.1011706     .076804
              FEMALE |   .1019097   .0345702     2.95   0.003     .0339321    .1698873
               SLEEP |  -.0026601   .0015133    -1.76   0.080    -.0056359    .0003156
       INTERNATIONAL |  -.0508645   .0487862    -1.04   0.298    -.1467959    .0450669
INTERNATIONAL_DOUBLE |   .1987325   .0748729     2.65   0.008     .0515052    .3459598
             SCHOLAR |    .120359   .0552383     2.18   0.030     .0117405    .2289775
               GREEK |   .0698237   .0516228     1.35   0.177    -.0316854    .1713327
               DRINK |   .0057247   .0029986     1.91   0.057    -.0001716     .011621
         GREEK_DRINK |  -.0076471   .0040963    -1.87   0.063    -.0157019    .0004076
             ATHLETE |  -.0456188    .037846    -1.21   0.229    -.1200377    .0288002
              FRIEND |   .0012602   .0005541     2.27   0.024     .0001706    .0023497
            DECISION |   -.065547   .0337348    -1.94   0.053    -.1318819    .0007879
               _cons |  -.7710578   .8522503    -0.90   0.366     -2.44689    .9047745
--------------------------------------------------------------------------------------

. gen ECON = .
(410 missing values generated)

. 
. replace ECON = 1 if MAJOR1 == "Economics" | MAJOR2 == "Economics"
(114 real changes made)

. replace ECON = 0 if ECON == .
(296 real changes made)

. gen SAT_FEMALE = SAT*FEMALE
(13 missing values generated)

. reg COLLGPA SAT LN_HSGPA HRSTD HRSTD_SQ DECISION FEMALE SAT_FEMALE ECON

      Source |       SS           df       MS      Number of obs   =       396
-------------+----------------------------------   F(8, 387)       =     23.87
       Model |  19.2540775         8  2.40675969   Prob > F        =    0.0000
    Residual |  39.0268511       387  .100844577   R-squared       =    0.3304
-------------+----------------------------------   Adj R-squared   =    0.3165
       Total |  58.2809286       395  .147546655   Root MSE        =    .31756

------------------------------------------------------------------------------
     COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         SAT |    .000796   .0001455     5.47   0.000     .0005099     .001082
    LN_HSGPA |    .789321   .1270285     6.21   0.000     .5395687    1.039073
       HRSTD |    .005484   .0025784     2.13   0.034     .0004146    .0105534
    HRSTD_SQ |  -.0000472   .0000329    -1.44   0.152    -.0001118    .0000174
    DECISION |  -.0667332   .0329952    -2.02   0.044    -.1316056   -.0018609
      FEMALE |   .1350697   .2857187     0.47   0.637    -.4266855    .6968249
  SAT_FEMALE |  -.0000202   .0002169    -0.09   0.926    -.0004466    .0004062
        ECON |  -.0394685   .0361716    -1.09   0.276    -.1105859     .031649
       _cons |   1.247748    .209842     5.95   0.000     .8351746    1.660321
------------------------------------------------------------------------------

. sum HRSTD

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       HRSTD |        410    20.74211    16.28902          0        120

. ovtest

Ramsey RESET test for omitted variables
Omitted: Powers of fitted values of COLLGPA

H0: Model has no omitted variables

F(3, 384) =   6.56
 Prob > F = 0.0002

. hettest

Breusch–Pagan/Cook–Weisberg test for heteroskedasticity 
Assumption: Normal error terms
Variable: Fitted values of COLLGPA

H0: Constant variance

    chi2(1) =   5.26
Prob > chi2 = 0.0218

. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
  SAT_FEMALE |     74.88    0.013354
      FEMALE |     74.40    0.013441
       HRSTD |      7.03    0.142292
    HRSTD_SQ |      6.79    0.147251
         SAT |      1.94    0.514940
    LN_HSGPA |      1.15    0.868229
    DECISION |      1.05    0.949606
        ECON |      1.03    0.970182
-------------+----------------------
    Mean VIF |     21.03

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLE
> TE FRIEND DECISION DECISION_SCHOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. estimates store MODEL1

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. estimates store MODEL2

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.39
       Model |  20.7754855        17  1.22208738   Prob > F        =    0.0000
    Residual |   36.694679       372   .09864161   R-squared       =    0.3615
-------------+----------------------------------   Adj R-squared   =    0.3323
       Total |  57.4701645       389  .147738212   Root MSE        =    .31407

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025018   .0006242     4.01   0.000     .0012744    .0037292
               HSGPA |   .8198369   .2472708     3.32   0.001      .333613    1.306061
           SAT_HSGPA |   -.000491   .0001765    -2.78   0.006    -.0008381    -.000144
            LN_HRSTD |   .0548129   .0224808     2.44   0.015     .0106075    .0990184
          LN_HREXTRA |   .0198842   .0216579     0.92   0.359    -.0227031    .0624714
              DOUBLE |  -.0121833   .0452548    -0.27   0.788    -.1011706     .076804
              FEMALE |   .1019097   .0345702     2.95   0.003     .0339321    .1698873
               SLEEP |  -.0026601   .0015133    -1.76   0.080    -.0056359    .0003156
       INTERNATIONAL |  -.0508645   .0487862    -1.04   0.298    -.1467959    .0450669
INTERNATIONAL_DOUBLE |   .1987325   .0748729     2.65   0.008     .0515052    .3459598
             SCHOLAR |    .120359   .0552383     2.18   0.030     .0117405    .2289775
               GREEK |   .0698237   .0516228     1.35   0.177    -.0316854    .1713327
               DRINK |   .0057247   .0029986     1.91   0.057    -.0001716     .011621
         GREEK_DRINK |  -.0076471   .0040963    -1.87   0.063    -.0157019    .0004076
             ATHLETE |  -.0456188    .037846    -1.21   0.229    -.1200377    .0288002
              FRIEND |   .0012602   .0005541     2.27   0.024     .0001706    .0023497
            DECISION |   -.065547   .0337348    -1.94   0.053    -.1318819    .0007879
               _cons |  -.7710578   .8522503    -0.90   0.366     -2.44689    .9047745
--------------------------------------------------------------------------------------

. estimates store MODEL3

. reg COLLGPA SAT LN_HSGPA HRSTD HRSTD_SQ DECISION FEMALE SAT_FEMALE ECON

      Source |       SS           df       MS      Number of obs   =       396
-------------+----------------------------------   F(8, 387)       =     23.87
       Model |  19.2540775         8  2.40675969   Prob > F        =    0.0000
    Residual |  39.0268511       387  .100844577   R-squared       =    0.3304
-------------+----------------------------------   Adj R-squared   =    0.3165
       Total |  58.2809286       395  .147546655   Root MSE        =    .31756

------------------------------------------------------------------------------
     COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         SAT |    .000796   .0001455     5.47   0.000     .0005099     .001082
    LN_HSGPA |    .789321   .1270285     6.21   0.000     .5395687    1.039073
       HRSTD |    .005484   .0025784     2.13   0.034     .0004146    .0105534
    HRSTD_SQ |  -.0000472   .0000329    -1.44   0.152    -.0001118    .0000174
    DECISION |  -.0667332   .0329952    -2.02   0.044    -.1316056   -.0018609
      FEMALE |   .1350697   .2857187     0.47   0.637    -.4266855    .6968249
  SAT_FEMALE |  -.0000202   .0002169    -0.09   0.926    -.0004466    .0004062
        ECON |  -.0394685   .0361716    -1.09   0.276    -.1105859     .031649
       _cons |   1.247748    .209842     5.95   0.000     .8351746    1.660321
------------------------------------------------------------------------------

. estimates store MODEL4

. estadd scalar ar2 = e(r2_a)

added scalar:
                e(ar2) =  .31652414

. reg COLLGPA SAT HSGPA SAT_HSGPA HRSTD HRSTD_SQ HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION DECISION_SC
> HOLAR HELP

      Source |       SS           df       MS      Number of obs   =       392
-------------+----------------------------------   F(20, 371)      =     10.34
       Model |   20.683997        20  1.03419985   Prob > F        =    0.0000
    Residual |  37.1067194       371  .100018111   R-squared       =    0.3579
-------------+----------------------------------   Adj R-squared   =    0.3233
       Total |  57.7907164       391  .147802344   Root MSE        =    .31626

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025322   .0006365     3.98   0.000     .0012807    .0037838
               HSGPA |   .8350137   .2513188     3.32   0.001     .3408257    1.329202
           SAT_HSGPA |  -.0004968   .0001796    -2.77   0.006    -.0008499   -.0001437
               HRSTD |   .0046991   .0027189     1.73   0.085    -.0006473    .0100454
            HRSTD_SQ |  -.0000465   .0000333    -1.40   0.164     -.000112     .000019
             HREXTRA |  -.0003422   .0020546    -0.17   0.868    -.0043823     .003698
              DOUBLE |  -.0095829   .0455201    -0.21   0.833    -.0990927    .0799268
              FEMALE |   .1021383   .0352661     2.90   0.004     .0327917    .1714849
               SLEEP |  -.0028144   .0015278    -1.84   0.066    -.0058185    .0001898
       INTERNATIONAL |   -.049735   .0490885    -1.01   0.312    -.1462616    .0467916
INTERNATIONAL_DOUBLE |    .194713   .0756949     2.57   0.010     .0458682    .3435578
             SCHOLAR |   .1363107   .0779102     1.75   0.081    -.0168903    .2895117
               GREEK |   .0624378    .052739     1.18   0.237    -.0412671    .1661427
               DRINK |   .0048101   .0030821     1.56   0.119    -.0012504    .0108706
         GREEK_DRINK |  -.0069606   .0041764    -1.67   0.096    -.0151731    .0012518
             ATHLETE |  -.0300607   .0397108    -0.76   0.450    -.1081471    .0480257
              FRIEND |   .0013746   .0005587     2.46   0.014      .000276    .0024733
            DECISION |  -.0294928   .1036012    -0.28   0.776     -.233212    .1742264
    DECISION_SCHOLAR |  -.0374292    .109322    -0.34   0.732    -.2523976    .1775392
                HELP |   .0027131   .0056024     0.48   0.628    -.0083033    .0137295
               _cons |   -.715881   .8762236    -0.82   0.414    -2.438869    1.007107
--------------------------------------------------------------------------------------

. 
. estimates store MODEL_1

. estadd scalar adjr2 = e(r2_a)

added scalar:
              e(adjr2) =  .3232982

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION HELP

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(18, 371)      =     11.62
       Model |  20.7139663        18  1.15077591   Prob > F        =    0.0000
    Residual |  36.7561982       371   .09907331   R-squared       =    0.3604
-------------+----------------------------------   Adj R-squared   =    0.3294
       Total |  57.4701645       389  .147738212   Root MSE        =    .31476

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0024613   .0006281     3.92   0.000     .0012262    .0036963
               HSGPA |   .8105809   .2482787     3.26   0.001      .322371    1.298791
           SAT_HSGPA |  -.0004804   .0001775    -2.71   0.007    -.0008294   -.0001314
            LN_HRSTD |   .0569015   .0235553     2.42   0.016     .0105828    .1032201
             HREXTRA |  -.0007619   .0020439    -0.37   0.710     -.004781    .0032572
              DOUBLE |  -.0077946   .0453195    -0.17   0.864    -.0969098    .0813206
              FEMALE |   .0985346   .0349658     2.82   0.005     .0297787    .1672905
               SLEEP |  -.0027117   .0015222    -1.78   0.076    -.0057049    .0002814
       INTERNATIONAL |  -.0540086   .0489261    -1.10   0.270     -.150216    .0421987
INTERNATIONAL_DOUBLE |   .1979442   .0752072     2.63   0.009     .0500583    .3458301
             SCHOLAR |   .1165172   .0555896     2.10   0.037     .0072071    .2258274
               GREEK |   .0651148    .052361     1.24   0.214    -.0378468    .1680764
               DRINK |   .0055687   .0030368     1.83   0.067    -.0004028    .0115402
         GREEK_DRINK |   -.007325   .0041325    -1.77   0.077    -.0154511    .0008011
             ATHLETE |  -.0278672   .0393816    -0.71   0.480    -.1053064     .049572
              FRIEND |   .0012707   .0005552     2.29   0.023      .000179    .0023624
            DECISION |  -.0606421   .0339507    -1.79   0.075    -.1274021     .006118
                HELP |   .0018107   .0055569     0.33   0.745    -.0091163    .0127378
               _cons |  -.6855695   .8555096    -0.80   0.423    -2.367825    .9966864
--------------------------------------------------------------------------------------

. estimates store MODEL_2

. estadd scalar adjr2 = e(r2_a)

added scalar:
              e(adjr2) =  .32939956

.  reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(17, 372)      =     12.39
       Model |  20.7754855        17  1.22208738   Prob > F        =    0.0000
    Residual |   36.694679       372   .09864161   R-squared       =    0.3615
-------------+----------------------------------   Adj R-squared   =    0.3323
       Total |  57.4701645       389  .147738212   Root MSE        =    .31407

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |   .0025018   .0006242     4.01   0.000     .0012744    .0037292
               HSGPA |   .8198369   .2472708     3.32   0.001      .333613    1.306061
           SAT_HSGPA |   -.000491   .0001765    -2.78   0.006    -.0008381    -.000144
            LN_HRSTD |   .0548129   .0224808     2.44   0.015     .0106075    .0990184
          LN_HREXTRA |   .0198842   .0216579     0.92   0.359    -.0227031    .0624714
              DOUBLE |  -.0121833   .0452548    -0.27   0.788    -.1011706     .076804
              FEMALE |   .1019097   .0345702     2.95   0.003     .0339321    .1698873
               SLEEP |  -.0026601   .0015133    -1.76   0.080    -.0056359    .0003156
       INTERNATIONAL |  -.0508645   .0487862    -1.04   0.298    -.1467959    .0450669
INTERNATIONAL_DOUBLE |   .1987325   .0748729     2.65   0.008     .0515052    .3459598
             SCHOLAR |    .120359   .0552383     2.18   0.030     .0117405    .2289775
               GREEK |   .0698237   .0516228     1.35   0.177    -.0316854    .1713327
               DRINK |   .0057247   .0029986     1.91   0.057    -.0001716     .011621
         GREEK_DRINK |  -.0076471   .0040963    -1.87   0.063    -.0157019    .0004076
             ATHLETE |  -.0456188    .037846    -1.21   0.229    -.1200377    .0288002
              FRIEND |   .0012602   .0005541     2.27   0.024     .0001706    .0023497
            DECISION |   -.065547   .0337348    -1.94   0.053    -.1318819    .0007879
               _cons |  -.7710578   .8522503    -0.90   0.366     -2.44689    .9047745
--------------------------------------------------------------------------------------

. estadd scalar adjr2 = e(r2_a)

added scalar:
              e(adjr2) =  .33232162

.  reg COLLGPA SAT LN_HSGPA HRSTD HRSTD_SQ DECISION FEMALE SAT_FEMALE ECON

      Source |       SS           df       MS      Number of obs   =       396
-------------+----------------------------------   F(8, 387)       =     23.87
       Model |  19.2540775         8  2.40675969   Prob > F        =    0.0000
    Residual |  39.0268511       387  .100844577   R-squared       =    0.3304
-------------+----------------------------------   Adj R-squared   =    0.3165
       Total |  58.2809286       395  .147546655   Root MSE        =    .31756

------------------------------------------------------------------------------
     COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         SAT |    .000796   .0001455     5.47   0.000     .0005099     .001082
    LN_HSGPA |    .789321   .1270285     6.21   0.000     .5395687    1.039073
       HRSTD |    .005484   .0025784     2.13   0.034     .0004146    .0105534
    HRSTD_SQ |  -.0000472   .0000329    -1.44   0.152    -.0001118    .0000174
    DECISION |  -.0667332   .0329952    -2.02   0.044    -.1316056   -.0018609
      FEMALE |   .1350697   .2857187     0.47   0.637    -.4266855    .6968249
  SAT_FEMALE |  -.0000202   .0002169    -0.09   0.926    -.0004466    .0004062
        ECON |  -.0394685   .0361716    -1.09   0.276    -.1105859     .031649
       _cons |   1.247748    .209842     5.95   0.000     .8351746    1.660321
------------------------------------------------------------------------------

. estimates store MODEL_4

. estadd scalar adjr2 = e(r2_a)

added scalar:
              e(adjr2) =  .31652414

. estout MODEL1 MODEL2 MODEL3 MODEL4, ///
option / not allowed
r(198);

.     cells(b(star fmt(3)) se(fmt(3) par)) ///
command cells is unrecognized
r(199);

.     stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations")) ///
command stats is unrecognized
r(199);

.     label varlabels(_cons Constant) ///
invalid syntax
r(198);

.     starlevels(* .1 ** .05 *** .01) ///
command starlevels is unrecognized
r(199);

.     delimiter(&) ///
command delimiter is unrecognized
r(199);

.     drop(_cons) ///
variable _cons not found
r(111);

.     title("Regression Models") ///
command title is unrecognized
r(199);

.     nonumbers ///
command nonumbers is unrecognized
r(199);

.     collabels("Model 1" "Model 2" "Model 3" "Azenui")
command collabels is unrecognized
r(199);

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4, ///
option / not allowed
r(198);

.     cells(b(star fmt(3)) se(fmt(3) par)) ///
command cells is unrecognized
r(199);

.     stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations")) ///
command stats is unrecognized
r(199);

.     label varlabels(_cons Constant) ///
invalid syntax
r(198);

.     starlevels(* .1 ** .05 *** .01) ///
command starlevels is unrecognized
r(199);

.     delimiter(&) ///
command delimiter is unrecognized
r(199);

.     drop(_cons) ///
variable _cons not found
r(111);

.     title("Regression Models") ///
command title is unrecognized
r(199);

.     nonumbers ///
command nonumbers is unrecognized
r(199);

.     collabels("Model 1" "Model 2" "Model 3" "Azenui")
command collabels is unrecognized
r(199);

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4,

----------------------------------------------------------------
                   MODEL1       MODEL2       MODEL3       MODEL4
                        b            b            b            b
----------------------------------------------------------------
SAT              .0025322     .0024613     .0025018      .000796
HSGPA            .8350137     .8105809     .8198369             
SAT_HSGPA       -.0004968    -.0004804     -.000491             
HRSTD            .0046991                                .005484
HRSTD_SQ        -.0000465                              -.0000472
HREXTRA         -.0003422    -.0007619                          
DOUBLE          -.0095829    -.0077946    -.0121833             
FEMALE           .1021383     .0985346     .1019097     .1350697
SLEEP           -.0028144    -.0027117    -.0026601             
INTERNATIO~L     -.049735    -.0540086    -.0508645             
INTERNATIO~E      .194713     .1979442     .1987325             
SCHOLAR          .1363107     .1165172      .120359             
GREEK            .0624378     .0651148     .0698237             
DRINK            .0048101     .0055687     .0057247             
GREEK_DRINK     -.0069606     -.007325    -.0076471             
ATHLETE         -.0300607    -.0278672    -.0456188             
FRIEND           .0013746     .0012707     .0012602             
DECISION        -.0294928    -.0606421     -.065547    -.0667332
DECISION_S~R    -.0374292                                       
HELP             .0027131     .0018107                          
LN_HRSTD                      .0569015     .0548129             
LN_HREXTRA                                 .0198842             
LN_HSGPA                                                 .789321
SAT_FEMALE                                             -.0000202
ECON                                                   -.0394685
_cons            -.715881    -.6855695    -.7710578     1.247748
----------------------------------------------------------------

.     cells(b(star fmt(3)) se(fmt(3) par))
command cells is unrecognized
r(199);

.     stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations"))
command stats is unrecognized
r(199);

.     label varlabels(_cons Constant)
invalid syntax
r(198);

.     starlevels(* .1 ** .05 *** .01)
command starlevels is unrecognized
r(199);

.     delimiter(&)
command delimiter is unrecognized
r(199);

.     drop(_cons)
variable _cons not found
r(111);

.     title("Regression Models")
command title is unrecognized
r(199);

.     nonumbers
command nonumbers is unrecognized
r(199);

.     collabels("Model 1" "Model 2" "Model 3" "Azenui")
command collabels is unrecognized
r(199);

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4, ///
option / not allowed
r(198);

. cells(b(star fmt(3)) se(fmt(3) par)) ///
command cells is unrecognized
r(199);

. stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations")) ///
command stats is unrecognized
r(199);

. label varlabels(_cons "Constant") ///
invalid syntax
r(198);

. starlevels(* .1 ** .05 *** .01) ///
command starlevels is unrecognized
r(199);

. drop(_cons) ///
variable _cons not found
r(111);

. title("Regression Models") ///
command title is unrecognized
r(199);

. nonumbers ///
command nonumbers is unrecognized
r(199);

. collabels("Model 1" "Model 2" "Model 3" "Azenui")
command collabels is unrecognized
r(199);

. estout MODEL1 MODEL2 MODEL3 MODEL4,

----------------------------------------------------------------
                   MODEL1       MODEL2       MODEL3       MODEL4
                        b            b            b            b
----------------------------------------------------------------
SAT              .0025322     .0024613     .0025018      .000796
HSGPA            .8350137     .8105809     .8198369             
SAT_HSGPA       -.0004968    -.0004804     -.000491             
HRSTD            .0046991                                .005484
HRSTD_SQ        -.0000465                              -.0000472
HREXTRA         -.0003422    -.0007619                          
DOUBLE          -.0095829    -.0077946    -.0121833             
FEMALE           .1021383     .0985346     .1019097     .1350697
SLEEP           -.0028144    -.0027117    -.0026601             
INTERNATIO~L     -.049735    -.0540086    -.0508645             
INTERNATIO~E      .194713     .1979442     .1987325             
SCHOLAR          .1363107     .1165172      .120359             
GREEK            .0624378     .0651148     .0698237             
DRINK            .0048101     .0055687     .0057247             
GREEK_DRINK     -.0069606     -.007325    -.0076471             
ATHLETE         -.0300607    -.0278672    -.0456188             
FRIEND           .0013746     .0012707     .0012602             
DECISION        -.0294928    -.0606421     -.065547    -.0667332
DECISION_S~R    -.0374292                                       
HELP             .0027131     .0018107                          
LN_HRSTD                      .0569015     .0548129             
LN_HREXTRA                                 .0198842             
LN_HSGPA                                                 .789321
SAT_FEMALE                                             -.0000202
ECON                                                   -.0394685
_cons            -.715881    -.6855695    -.7710578     1.247748
----------------------------------------------------------------

. cells(b(star fmt(3)) se(fmt(3) par))
command cells is unrecognized
r(199);

. stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations"))
command stats is unrecognized
r(199);

. label varlabels(_cons "Constant")
invalid syntax
r(198);

. starlevels(* .1 ** .05 *** .01)
command starlevels is unrecognized
r(199);

. drop(_cons)
variable _cons not found
r(111);

. title("Regression Models")
command title is unrecognized
r(199);

. nonumbers
command nonumbers is unrecognized
r(199);

. collabels("Model 1" "Model 2" "Model 3" "Azenui")
command collabels is unrecognized
r(199);

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4,cells(b(star fmt(3)) se(fmt(3) par))stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations")) label varlabels(_cons "Constant")starleve
> ls(* .1 ** .05 *** .01)drop(_cons)title("Regression Models")nonumbers collabels("Model 1" "Model 2" "Model 3" "Azenui")

Regression Models
------------------------------------------------------------------------------------
                           MODEL1          MODEL2          MODEL3          MODEL4   
                          Model 1         Model 1         Model 1         Model 1   
------------------------------------------------------------------------------------
SAT                         0.003***        0.002***        0.003***        0.001***
                          (0.001)         (0.001)         (0.001)         (0.000)   
HSGPA                       0.835***        0.811***        0.820***                
                          (0.251)         (0.248)         (0.247)                   
SAT_HSGPA                  -0.000***       -0.000***       -0.000***                
                          (0.000)         (0.000)         (0.000)                   
HRSTD                       0.005*                                          0.005** 
                          (0.003)                                         (0.003)   
HRSTD_SQ                   -0.000                                          -0.000   
                          (0.000)                                         (0.000)   
HREXTRA                    -0.000          -0.001                                   
                          (0.002)         (0.002)                                   
DOUBLE                     -0.010          -0.008          -0.012                   
                          (0.046)         (0.045)         (0.045)                   
FEMALE                      0.102***        0.099***        0.102***        0.135   
                          (0.035)         (0.035)         (0.035)         (0.286)   
SLEEP                      -0.003*         -0.003*         -0.003*                  
                          (0.002)         (0.002)         (0.002)                   
ETHNIC==I                  -0.050          -0.054          -0.051                   
                          (0.049)         (0.049)         (0.049)                   
INTERNATIONAL_DOUBLE        0.195**         0.198***        0.199***                
                          (0.076)         (0.075)         (0.075)                   
SCHOLAR                     0.136*          0.117**         0.120**                 
                          (0.078)         (0.056)         (0.055)                   
GREEK                       0.062           0.065           0.070                   
                          (0.053)         (0.052)         (0.052)                   
DRINK                       0.005           0.006*          0.006*                  
                          (0.003)         (0.003)         (0.003)                   
GREEK_DRINK                -0.007*         -0.007*         -0.008*                  
                          (0.004)         (0.004)         (0.004)                   
ATHLETE                    -0.030          -0.028          -0.046                   
                          (0.040)         (0.039)         (0.038)                   
FRIEND                      0.001**         0.001**         0.001**                 
                          (0.001)         (0.001)         (0.001)                   
DECISION                   -0.029          -0.061*         -0.066*         -0.067** 
                          (0.104)         (0.034)         (0.034)         (0.033)   
DECISION_SCHOLAR           -0.037                                                   
                          (0.109)                                                   
HELP                        0.003           0.002                                   
                          (0.006)         (0.006)                                   
LN_HRSTD                                    0.057**         0.055**                 
                                          (0.024)         (0.022)                   
LN_HREXTRA                                                  0.020                   
                                                          (0.022)                   
LN_HSGPA                                                                    0.789***
                                                                          (0.127)   
SAT_FEMALE                                                                 -0.000   
                                                                          (0.000)   
ECON                                                                       -0.039   
                                                                          (0.036)   
------------------------------------------------------------------------------------
Adj. R-squared                                                                      
Observations                  392             390             390             396   
------------------------------------------------------------------------------------

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4,cells(b(star fmt(3)) se(fmt(3) par))stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations")) label varlabels(_cons "Constant")starleve
> ls(* .1 ** .05 *** .01)drop(_cons)title("Regression Models")nonumberscollabels("Model 1" "Model 2" "Model 3" "Azenui")
option nonumberscollabels() not allowed
r(198);

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4,cells(b(star fmt(3)) se(fmt(3) par))stats(adjr2 N, fmt(2 0) labels("Adj. R-squared" "Observations"))label varlabels(_cons "Constant") starleve
> ls(* .1 ** .05 *** .01) drop(_cons)title("Regression Models")nonum collabels(none) mlabels("Model 1" "Model 2" "Model 3" "Azenui")

Regression Models
------------------------------------------------------------------------------------
                          Model 1         Model 2         Model 3          Azenui   
------------------------------------------------------------------------------------
SAT                         0.003***        0.002***        0.003***        0.001***
                          (0.001)         (0.001)         (0.001)         (0.000)   
HSGPA                       0.835***        0.811***        0.820***                
                          (0.251)         (0.248)         (0.247)                   
SAT_HSGPA                  -0.000***       -0.000***       -0.000***                
                          (0.000)         (0.000)         (0.000)                   
HRSTD                       0.005*                                          0.005** 
                          (0.003)                                         (0.003)   
HRSTD_SQ                   -0.000                                          -0.000   
                          (0.000)                                         (0.000)   
HREXTRA                    -0.000          -0.001                                   
                          (0.002)         (0.002)                                   
DOUBLE                     -0.010          -0.008          -0.012                   
                          (0.046)         (0.045)         (0.045)                   
FEMALE                      0.102***        0.099***        0.102***        0.135   
                          (0.035)         (0.035)         (0.035)         (0.286)   
SLEEP                      -0.003*         -0.003*         -0.003*                  
                          (0.002)         (0.002)         (0.002)                   
ETHNIC==I                  -0.050          -0.054          -0.051                   
                          (0.049)         (0.049)         (0.049)                   
INTERNATIONAL_DOUBLE        0.195**         0.198***        0.199***                
                          (0.076)         (0.075)         (0.075)                   
SCHOLAR                     0.136*          0.117**         0.120**                 
                          (0.078)         (0.056)         (0.055)                   
GREEK                       0.062           0.065           0.070                   
                          (0.053)         (0.052)         (0.052)                   
DRINK                       0.005           0.006*          0.006*                  
                          (0.003)         (0.003)         (0.003)                   
GREEK_DRINK                -0.007*         -0.007*         -0.008*                  
                          (0.004)         (0.004)         (0.004)                   
ATHLETE                    -0.030          -0.028          -0.046                   
                          (0.040)         (0.039)         (0.038)                   
FRIEND                      0.001**         0.001**         0.001**                 
                          (0.001)         (0.001)         (0.001)                   
DECISION                   -0.029          -0.061*         -0.066*         -0.067** 
                          (0.104)         (0.034)         (0.034)         (0.033)   
DECISION_SCHOLAR           -0.037                                                   
                          (0.109)                                                   
HELP                        0.003           0.002                                   
                          (0.006)         (0.006)                                   
LN_HRSTD                                    0.057**         0.055**                 
                                          (0.024)         (0.022)                   
LN_HREXTRA                                                  0.020                   
                                                          (0.022)                   
LN_HSGPA                                                                    0.789***
                                                                          (0.127)   
SAT_FEMALE                                                                 -0.000   
                                                                          (0.000)   
ECON                                                                       -0.039   
                                                                          (0.036)   
------------------------------------------------------------------------------------
Adj. R-squared                                                                      
Observations                  392             390             390             396   
------------------------------------------------------------------------------------

. 
. estout MODEL1 MODEL2 MODEL3 MODEL4,cells(b(star fmt(3)) se(fmt(3) par))stats(N, fmt(0) labels("Observations")) scalars("adjr2 Adjusted R-squared", fmt(3)) label varlabels(_cons 
> "Constant") /starlevels(* .1 ** .05 *** .01) drop(_cons) title("Regression Models") nonum collabels(none) mlabels("Model 1" "Model 2" "Model 3" "Azenui")
option scalars() not allowed
r(198);

. 
. esttab MODEL1 MODEL2 MODEL3 MODEL4,cells(b(star fmt(3)) se(fmt(3) par))stats(N, fmt(0) labels("Observations")) scalars("adjr2 Adjusted R-squared", fmt(3)) label varlabels(_cons 
> "Constant") /starlevels(* .1 ** .05 *** .01) drop(_cons) title("Regression Models") nonum collabels(none) mlabels("Model 1" "Model 2" "Model 3" "Azenui")
option / not allowed
r(198);

. 
. esttab MODEL1 MODEL2 MODEL3 MODEL4, cells(b(star fmt(3)) se(fmt(3) par)) stats(adjr2 N, fmt(3 0) labels("Adjusted R-squared" "Observations")) label varlabels(_cons "Constant") s
> tarlevels(* .1 ** .05 *** .01) drop(_cons) nonum collabels(none) mlabels("Model 1" "Model 2" "Model 3" "Azenui")

------------------------------------------------------------------------------------
                          Model 1         Model 2         Model 3          Azenui   
------------------------------------------------------------------------------------
SAT                         0.003***        0.002***        0.003***        0.001***
                          (0.001)         (0.001)         (0.001)         (0.000)   
HSGPA                       0.835***        0.811***        0.820***                
                          (0.251)         (0.248)         (0.247)                   
SAT_HSGPA                  -0.000***       -0.000***       -0.000***                
                          (0.000)         (0.000)         (0.000)                   
HRSTD                       0.005*                                          0.005** 
                          (0.003)                                         (0.003)   
HRSTD_SQ                   -0.000                                          -0.000   
                          (0.000)                                         (0.000)   
HREXTRA                    -0.000          -0.001                                   
                          (0.002)         (0.002)                                   
DOUBLE                     -0.010          -0.008          -0.012                   
                          (0.046)         (0.045)         (0.045)                   
FEMALE                      0.102***        0.099***        0.102***        0.135   
                          (0.035)         (0.035)         (0.035)         (0.286)   
SLEEP                      -0.003*         -0.003*         -0.003*                  
                          (0.002)         (0.002)         (0.002)                   
ETHNIC==I                  -0.050          -0.054          -0.051                   
                          (0.049)         (0.049)         (0.049)                   
INTERNATIONAL_DOUBLE        0.195**         0.198***        0.199***                
                          (0.076)         (0.075)         (0.075)                   
SCHOLAR                     0.136*          0.117**         0.120**                 
                          (0.078)         (0.056)         (0.055)                   
GREEK                       0.062           0.065           0.070                   
                          (0.053)         (0.052)         (0.052)                   
DRINK                       0.005           0.006*          0.006*                  
                          (0.003)         (0.003)         (0.003)                   
GREEK_DRINK                -0.007*         -0.007*         -0.008*                  
                          (0.004)         (0.004)         (0.004)                   
ATHLETE                    -0.030          -0.028          -0.046                   
                          (0.040)         (0.039)         (0.038)                   
FRIEND                      0.001**         0.001**         0.001**                 
                          (0.001)         (0.001)         (0.001)                   
DECISION                   -0.029          -0.061*         -0.066*         -0.067** 
                          (0.104)         (0.034)         (0.034)         (0.033)   
DECISION_SCHOLAR           -0.037                                                   
                          (0.109)                                                   
HELP                        0.003           0.002                                   
                          (0.006)         (0.006)                                   
LN_HRSTD                                    0.057**         0.055**                 
                                          (0.024)         (0.022)                   
LN_HREXTRA                                                  0.020                   
                                                          (0.022)                   
LN_HSGPA                                                                    0.789***
                                                                          (0.127)   
SAT_FEMALE                                                                 -0.000   
                                                                          (0.000)   
ECON                                                                       -0.039   
                                                                          (0.036)   
------------------------------------------------------------------------------------
Adjusted R-squared                                                                  
Observations                  392             390             390             396   
------------------------------------------------------------------------------------

. 
. esttab MODEL1 MODEL2 MODEL3 MODEL4, cells(b(star fmt(3)) se(fmt(3) par)) mtitle("Model 1" "Model 2" "Model 3" "Azenui") addstats("Adjusted R-squared", e(r2_a)) addstats("Observa
> tions", e(N)) label varlabels(_cons "Constant") starlevels(* .1 ** .05 *** .01) drop(_cons) nonum
option addstats() not allowed
r(198);

. 
. esttab MODEL1 MODEL2 MODEL3 MODEL4, cells(b(star fmt(3)) se(fmt(3) par)) stats(N r2_a, fmt(0 3) labels("Observations" "Adjusted R-squared")) mtitle("Model 1" "Model 2" "Model 3"
>  "Azenui") label varlabels(_cons "Constant") starlevels(* .1 ** .05 *** .01) drop(_cons) nonum

------------------------------------------------------------------------------------
                          Model 1         Model 2         Model 3          Azenui   
                             b/se            b/se            b/se            b/se   
------------------------------------------------------------------------------------
SAT                         0.003***        0.002***        0.003***        0.001***
                          (0.001)         (0.001)         (0.001)         (0.000)   
HSGPA                       0.835***        0.811***        0.820***                
                          (0.251)         (0.248)         (0.247)                   
SAT_HSGPA                  -0.000***       -0.000***       -0.000***                
                          (0.000)         (0.000)         (0.000)                   
HRSTD                       0.005*                                          0.005** 
                          (0.003)                                         (0.003)   
HRSTD_SQ                   -0.000                                          -0.000   
                          (0.000)                                         (0.000)   
HREXTRA                    -0.000          -0.001                                   
                          (0.002)         (0.002)                                   
DOUBLE                     -0.010          -0.008          -0.012                   
                          (0.046)         (0.045)         (0.045)                   
FEMALE                      0.102***        0.099***        0.102***        0.135   
                          (0.035)         (0.035)         (0.035)         (0.286)   
SLEEP                      -0.003*         -0.003*         -0.003*                  
                          (0.002)         (0.002)         (0.002)                   
ETHNIC==I                  -0.050          -0.054          -0.051                   
                          (0.049)         (0.049)         (0.049)                   
INTERNATIONAL_DOUBLE        0.195**         0.198***        0.199***                
                          (0.076)         (0.075)         (0.075)                   
SCHOLAR                     0.136*          0.117**         0.120**                 
                          (0.078)         (0.056)         (0.055)                   
GREEK                       0.062           0.065           0.070                   
                          (0.053)         (0.052)         (0.052)                   
DRINK                       0.005           0.006*          0.006*                  
                          (0.003)         (0.003)         (0.003)                   
GREEK_DRINK                -0.007*         -0.007*         -0.008*                  
                          (0.004)         (0.004)         (0.004)                   
ATHLETE                    -0.030          -0.028          -0.046                   
                          (0.040)         (0.039)         (0.038)                   
FRIEND                      0.001**         0.001**         0.001**                 
                          (0.001)         (0.001)         (0.001)                   
DECISION                   -0.029          -0.061*         -0.066*         -0.067** 
                          (0.104)         (0.034)         (0.034)         (0.033)   
DECISION_SCHOLAR           -0.037                                                   
                          (0.109)                                                   
HELP                        0.003           0.002                                   
                          (0.006)         (0.006)                                   
LN_HRSTD                                    0.057**         0.055**                 
                                          (0.024)         (0.022)                   
LN_HREXTRA                                                  0.020                   
                                                          (0.022)                   
LN_HSGPA                                                                    0.789***
                                                                          (0.127)   
SAT_FEMALE                                                                 -0.000   
                                                                          (0.000)   
ECON                                                                       -0.039   
                                                                          (0.036)   
------------------------------------------------------------------------------------
Observations                  392             390             390             396   
Adjusted R-squared          0.323           0.329           0.332           0.317   
------------------------------------------------------------------------------------

. 
. clear

. set obs 1
Number of observations (_N) was 0, now 1.

. 
. gen SAT = 1480

. gen HSGPA = 3.95

. gen HRSTD = 20

. gen HREXTRA = 5

. gen DOUBLE = 1

. gen FEMALE = 0

. gen SLEEP = 34

. gen INTERNATIONAL = 1

. gen INTERNATIONAL_DOUBLE = 1

. gen SCHOLAR = 1

. gen GREEK = 0

. gen DRINK = 1

. gen GREEK_DRINK = 0

. gen ATHLETE = 0

. gen FRIEND = 1

. gen DECISION = 0

. 
. use "path/to/original_data.dta", clear
file path/to/original_data.dta not found
r(601);

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRINK ATHLETE FRIEND DECISION
variable COLLGPA not found
r(111);

. 
. use "DOwnloads/ECONOMETRICS FINAL PROJECT.dta", clear
file DOwnloads/ECONOMETRICS FINAL PROJECT.dta not found
r(601);

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK ATHLETE FRIEND DECISION
variable COLLGPA not found
r(111);

. 
. save "/Users/dagmawizerihun/Downloads/ECON FINAL PROJ.dta"
file /Users/dagmawizerihun/Downloads/ECON FINAL PROJ.dta saved

. use "/Users/dagmawizerihun/Downloads/ECONOMETRICS FINAL PROJECT.dta"

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK ATHLETE FRIEND DECISION
variable LN_HRSTD not found
r(111);

. 
. gen LN_HRSTD = ln(HRSTD)
(2 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK ATHLETE FRIEND DECISION
variable LN_HREXTRA not found
r(111);

. 
. gen LN_HREXTRA = ln(HREXTRA)
(17 missing values generated)

. reg COLLGPA SAT HSGPA SAT_HSGPA LN_HRSTD LN_HREXTRA DOUBLE FEMALE SLEEP INTERNATIONAL INTERNATIONAL_DOUBLE SCHOLAR GREEK DRINK GREEK_DRI
> NK ATHLETE FRIEND DECISION

      Source |       SS           df       MS      Number of obs   =       374
-------------+----------------------------------   F(17, 356)      =     11.62
       Model |  18.9254738        17  1.11326317   Prob > F        =    0.0000
    Residual |  34.1088649       356  .095811418   R-squared       =    0.3569
-------------+----------------------------------   Adj R-squared   =    0.3261
       Total |  53.0343387       373  .142183214   Root MSE        =    .30953

--------------------------------------------------------------------------------------
             COLLGPA | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
                 SAT |    .002278   .0006205     3.67   0.000     .0010577    .0034983
               HSGPA |   .7426161   .2456956     3.02   0.003     .2594189    1.225813
           SAT_HSGPA |  -.0004397   .0001753    -2.51   0.013    -.0007845    -.000095
            LN_HRSTD |   .0585603   .0228962     2.56   0.011     .0135314    .1035891
          LN_HREXTRA |  -.0025794   .0258229    -0.10   0.920     -.053364    .0482052
              DOUBLE |  -.0142643   .0447023    -0.32   0.750     -.102178    .0736494
              FEMALE |   .1154593   .0348224     3.32   0.001     .0469757    .1839428
               SLEEP |  -.0027091   .0015134    -1.79   0.074    -.0056854    .0002671
       INTERNATIONAL |  -.0315055   .0499777    -0.63   0.529    -.1297941    .0667832
INTERNATIONAL_DOUBLE |   .1722265   .0758653     2.27   0.024     .0230259    .3214271
             SCHOLAR |   .1301491   .0559867     2.32   0.021     .0200428    .2402554
               GREEK |   .0730576   .0513863     1.42   0.156    -.0280012    .1741165
               DRINK |   .0052344    .003022     1.73   0.084    -.0007088    .0111777
         GREEK_DRINK |  -.0068141   .0041066    -1.66   0.098    -.0148903     .001262
             ATHLETE |  -.0330735    .039176    -0.84   0.399     -.110119    .0439721
              FRIEND |   .0013835   .0005634     2.46   0.015     .0002754    .0024915
            DECISION |  -.0663704   .0342343    -1.94   0.053    -.1336973    .0009566
               _cons |  -.4128045   .8485288    -0.49   0.627    -2.081564    1.255955
--------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/dagmawizerihun/Downloads/ECON307GPAProjectKhushiDagmawi.log
  log type:  text
 closed on:   6 May 2023, 03:24:52
------------------------------------------------------------------------------------------------------------------------------------------
